MikroElektronika/core_packages/PIC/XC8/def/PIC18LF56K42/mcu.h
extern volatile RC6PPSbits_t RC6PPSbits __at(0x3A16);
// bitfield macros
#define _RC6PPS_RC6PPS0_POSN                                0x0
#define _RC6PPS_RC6PPS0_POSITION                            0x0
#define _RC6PPS_RC6PPS0_SIZE                                0x1
#define _RC6PPS_RC6PPS0_LENGTH                              0x1
#define _RC6PPS_RC6PPS0_MASK                                0x1
#define _RC6PPS_RC6PPS1_POSN                                0x1
#define _RC6PPS_RC6PPS1_POSITION                            0x1
#define _RC6PPS_RC6PPS1_SIZE                                0x1
#define _RC6PPS_RC6PPS1_LENGTH                              0x1
#define _RC6PPS_RC6PPS1_MASK                                0x2
#define _RC6PPS_RC6PPS2_POSN                                0x2
#define _RC6PPS_RC6PPS2_POSITION                            0x2
#define _RC6PPS_RC6PPS2_SIZE                                0x1
#define _RC6PPS_RC6PPS2_LENGTH                              0x1
#define _RC6PPS_RC6PPS2_MASK                                0x4
#define _RC6PPS_RC6PPS3_POSN                                0x3
#define _RC6PPS_RC6PPS3_POSITION                            0x3
#define _RC6PPS_RC6PPS3_SIZE                                0x1
#define _RC6PPS_RC6PPS3_LENGTH                              0x1
#define _RC6PPS_RC6PPS3_MASK                                0x8
#define _RC6PPS_RC6PPS4_POSN                                0x4
#define _RC6PPS_RC6PPS4_POSITION                            0x4
#define _RC6PPS_RC6PPS4_SIZE                                0x1
#define _RC6PPS_RC6PPS4_LENGTH                              0x1
#define _RC6PPS_RC6PPS4_MASK                                0x10
#define _RC6PPS_RC6PPS5_POSN                                0x5
#define _RC6PPS_RC6PPS5_POSITION                            0x5
#define _RC6PPS_RC6PPS5_SIZE                                0x1
#define _RC6PPS_RC6PPS5_LENGTH                              0x1
#define _RC6PPS_RC6PPS5_MASK                                0x20

// Register: RC7PPS
#define RC7PPS RC7PPS
extern volatile unsigned char           RC7PPS              __at(0x3A17);
#ifndef _LIB_BUILD
asm("RC7PPS equ 03A17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC7PPS0                :1;
        unsigned RC7PPS1                :1;
        unsigned RC7PPS2                :1;
        unsigned RC7PPS3                :1;
        unsigned RC7PPS4                :1;
        unsigned RC7PPS5                :1;
    };
} RC7PPSbits_t;
extern volatile RC7PPSbits_t RC7PPSbits __at(0x3A17);
// bitfield macros
#define _RC7PPS_RC7PPS0_POSN                                0x0
#define _RC7PPS_RC7PPS0_POSITION                            0x0
#define _RC7PPS_RC7PPS0_SIZE                                0x1
#define _RC7PPS_RC7PPS0_LENGTH                              0x1
#define _RC7PPS_RC7PPS0_MASK                                0x1
#define _RC7PPS_RC7PPS1_POSN                                0x1
#define _RC7PPS_RC7PPS1_POSITION                            0x1
#define _RC7PPS_RC7PPS1_SIZE                                0x1
#define _RC7PPS_RC7PPS1_LENGTH                              0x1
#define _RC7PPS_RC7PPS1_MASK                                0x2
#define _RC7PPS_RC7PPS2_POSN                                0x2
#define _RC7PPS_RC7PPS2_POSITION                            0x2
#define _RC7PPS_RC7PPS2_SIZE                                0x1
#define _RC7PPS_RC7PPS2_LENGTH                              0x1
#define _RC7PPS_RC7PPS2_MASK                                0x4
#define _RC7PPS_RC7PPS3_POSN                                0x3
#define _RC7PPS_RC7PPS3_POSITION                            0x3
#define _RC7PPS_RC7PPS3_SIZE                                0x1
#define _RC7PPS_RC7PPS3_LENGTH                              0x1
#define _RC7PPS_RC7PPS3_MASK                                0x8
#define _RC7PPS_RC7PPS4_POSN                                0x4
#define _RC7PPS_RC7PPS4_POSITION                            0x4
#define _RC7PPS_RC7PPS4_SIZE                                0x1
#define _RC7PPS_RC7PPS4_LENGTH                              0x1
#define _RC7PPS_RC7PPS4_MASK                                0x10
#define _RC7PPS_RC7PPS5_POSN                                0x5
#define _RC7PPS_RC7PPS5_POSITION                            0x5
#define _RC7PPS_RC7PPS5_SIZE                                0x1
#define _RC7PPS_RC7PPS5_LENGTH                              0x1
#define _RC7PPS_RC7PPS5_MASK                                0x20

// Register: RD0PPS
#define RD0PPS RD0PPS
extern volatile unsigned char           RD0PPS              __at(0x3A18);
#ifndef _LIB_BUILD
asm("RD0PPS equ 03A18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD0PPS0                :1;
        unsigned RD0PPS1                :1;
        unsigned RD0PPS2                :1;
        unsigned RD0PPS3                :1;
        unsigned RD0PPS4                :1;
        unsigned RD0PPS5                :1;
    };
} RD0PPSbits_t;
extern volatile RD0PPSbits_t RD0PPSbits __at(0x3A18);
// bitfield macros
#define _RD0PPS_RD0PPS0_POSN                                0x0
#define _RD0PPS_RD0PPS0_POSITION                            0x0
#define _RD0PPS_RD0PPS0_SIZE                                0x1
#define _RD0PPS_RD0PPS0_LENGTH                              0x1
#define _RD0PPS_RD0PPS0_MASK                                0x1
#define _RD0PPS_RD0PPS1_POSN                                0x1
#define _RD0PPS_RD0PPS1_POSITION                            0x1
#define _RD0PPS_RD0PPS1_SIZE                                0x1
#define _RD0PPS_RD0PPS1_LENGTH                              0x1
#define _RD0PPS_RD0PPS1_MASK                                0x2
#define _RD0PPS_RD0PPS2_POSN                                0x2
#define _RD0PPS_RD0PPS2_POSITION                            0x2
#define _RD0PPS_RD0PPS2_SIZE                                0x1
#define _RD0PPS_RD0PPS2_LENGTH                              0x1
#define _RD0PPS_RD0PPS2_MASK                                0x4
#define _RD0PPS_RD0PPS3_POSN                                0x3
#define _RD0PPS_RD0PPS3_POSITION                            0x3
#define _RD0PPS_RD0PPS3_SIZE                                0x1
#define _RD0PPS_RD0PPS3_LENGTH                              0x1
#define _RD0PPS_RD0PPS3_MASK                                0x8
#define _RD0PPS_RD0PPS4_POSN                                0x4
#define _RD0PPS_RD0PPS4_POSITION                            0x4
#define _RD0PPS_RD0PPS4_SIZE                                0x1
#define _RD0PPS_RD0PPS4_LENGTH                              0x1
#define _RD0PPS_RD0PPS4_MASK                                0x10
#define _RD0PPS_RD0PPS5_POSN                                0x5
#define _RD0PPS_RD0PPS5_POSITION                            0x5
#define _RD0PPS_RD0PPS5_SIZE                                0x1
#define _RD0PPS_RD0PPS5_LENGTH                              0x1
#define _RD0PPS_RD0PPS5_MASK                                0x20

// Register: RD1PPS
#define RD1PPS RD1PPS
extern volatile unsigned char           RD1PPS              __at(0x3A19);
#ifndef _LIB_BUILD
asm("RD1PPS equ 03A19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD1PPS0                :1;
        unsigned RD1PPS1                :1;
        unsigned RD1PPS2                :1;
        unsigned RD1PPS3                :1;
        unsigned RD1PPS4                :1;
        unsigned RD1PPS5                :1;
    };
} RD1PPSbits_t;
extern volatile RD1PPSbits_t RD1PPSbits __at(0x3A19);
// bitfield macros
#define _RD1PPS_RD1PPS0_POSN                                0x0
#define _RD1PPS_RD1PPS0_POSITION                            0x0
#define _RD1PPS_RD1PPS0_SIZE                                0x1
#define _RD1PPS_RD1PPS0_LENGTH                              0x1
#define _RD1PPS_RD1PPS0_MASK                                0x1
#define _RD1PPS_RD1PPS1_POSN                                0x1
#define _RD1PPS_RD1PPS1_POSITION                            0x1
#define _RD1PPS_RD1PPS1_SIZE                                0x1
#define _RD1PPS_RD1PPS1_LENGTH                              0x1
#define _RD1PPS_RD1PPS1_MASK                                0x2
#define _RD1PPS_RD1PPS2_POSN                                0x2
#define _RD1PPS_RD1PPS2_POSITION                            0x2
#define _RD1PPS_RD1PPS2_SIZE                                0x1
#define _RD1PPS_RD1PPS2_LENGTH                              0x1
#define _RD1PPS_RD1PPS2_MASK                                0x4
#define _RD1PPS_RD1PPS3_POSN                                0x3
#define _RD1PPS_RD1PPS3_POSITION                            0x3
#define _RD1PPS_RD1PPS3_SIZE                                0x1
#define _RD1PPS_RD1PPS3_LENGTH                              0x1
#define _RD1PPS_RD1PPS3_MASK                                0x8
#define _RD1PPS_RD1PPS4_POSN                                0x4
#define _RD1PPS_RD1PPS4_POSITION                            0x4
#define _RD1PPS_RD1PPS4_SIZE                                0x1
#define _RD1PPS_RD1PPS4_LENGTH                              0x1
#define _RD1PPS_RD1PPS4_MASK                                0x10
#define _RD1PPS_RD1PPS5_POSN                                0x5
#define _RD1PPS_RD1PPS5_POSITION                            0x5
#define _RD1PPS_RD1PPS5_SIZE                                0x1
#define _RD1PPS_RD1PPS5_LENGTH                              0x1
#define _RD1PPS_RD1PPS5_MASK                                0x20

// Register: RD2PPS
#define RD2PPS RD2PPS
extern volatile unsigned char           RD2PPS              __at(0x3A1A);
#ifndef _LIB_BUILD
asm("RD2PPS equ 03A1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD2PPS0                :1;
        unsigned RD2PPS1                :1;
        unsigned RD2PPS2                :1;
        unsigned RD2PPS3                :1;
        unsigned RD2PPS4                :1;
        unsigned RD2PPS5                :1;
    };
} RD2PPSbits_t;
