MikroElektronika/core_packages/PIC/XC8/def/PIC18LF56K42/mcu.h
// Register: INT0PPS
#define INT0PPS INT0PPS
extern volatile unsigned char           INT0PPS             __at(0x3AC0);
#ifndef _LIB_BUILD
asm("INT0PPS equ 03AC0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0PPS                :6;
    };
} INT0PPSbits_t;
extern volatile INT0PPSbits_t INT0PPSbits __at(0x3AC0);
// bitfield macros
#define _INT0PPS_INT0PPS_POSN                               0x0
#define _INT0PPS_INT0PPS_POSITION                           0x0
#define _INT0PPS_INT0PPS_SIZE                               0x6
#define _INT0PPS_INT0PPS_LENGTH                             0x6
#define _INT0PPS_INT0PPS_MASK                               0x3F

// Register: INT1PPS
#define INT1PPS INT1PPS
extern volatile unsigned char           INT1PPS             __at(0x3AC1);
#ifndef _LIB_BUILD
asm("INT1PPS equ 03AC1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1PPS                :6;
    };
} INT1PPSbits_t;
extern volatile INT1PPSbits_t INT1PPSbits __at(0x3AC1);
// bitfield macros
#define _INT1PPS_INT1PPS_POSN                               0x0
#define _INT1PPS_INT1PPS_POSITION                           0x0
#define _INT1PPS_INT1PPS_SIZE                               0x6
#define _INT1PPS_INT1PPS_LENGTH                             0x6
#define _INT1PPS_INT1PPS_MASK                               0x3F

// Register: INT2PPS
#define INT2PPS INT2PPS
extern volatile unsigned char           INT2PPS             __at(0x3AC2);
#ifndef _LIB_BUILD
asm("INT2PPS equ 03AC2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT2PPS                :6;
    };
} INT2PPSbits_t;
extern volatile INT2PPSbits_t INT2PPSbits __at(0x3AC2);
// bitfield macros
#define _INT2PPS_INT2PPS_POSN                               0x0
#define _INT2PPS_INT2PPS_POSITION                           0x0
#define _INT2PPS_INT2PPS_SIZE                               0x6
#define _INT2PPS_INT2PPS_LENGTH                             0x6
#define _INT2PPS_INT2PPS_MASK                               0x3F

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
extern volatile unsigned char           T0CKIPPS            __at(0x3AC3);
#ifndef _LIB_BUILD
asm("T0CKIPPS equ 03AC3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T0CKIPPS               :6;
    };
} T0CKIPPSbits_t;
extern volatile T0CKIPPSbits_t T0CKIPPSbits __at(0x3AC3);
// bitfield macros
#define _T0CKIPPS_T0CKIPPS_POSN                             0x0
#define _T0CKIPPS_T0CKIPPS_POSITION                         0x0
#define _T0CKIPPS_T0CKIPPS_SIZE                             0x6
#define _T0CKIPPS_T0CKIPPS_LENGTH                           0x6
#define _T0CKIPPS_T0CKIPPS_MASK                             0x3F

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
extern volatile unsigned char           T1CKIPPS            __at(0x3AC4);
#ifndef _LIB_BUILD
asm("T1CKIPPS equ 03AC4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1CKIPPS               :6;
    };
} T1CKIPPSbits_t;
extern volatile T1CKIPPSbits_t T1CKIPPSbits __at(0x3AC4);
// bitfield macros
#define _T1CKIPPS_T1CKIPPS_POSN                             0x0
#define _T1CKIPPS_T1CKIPPS_POSITION                         0x0
#define _T1CKIPPS_T1CKIPPS_SIZE                             0x6
#define _T1CKIPPS_T1CKIPPS_LENGTH                           0x6
#define _T1CKIPPS_T1CKIPPS_MASK                             0x3F

// Register: T1GPPS
#define T1GPPS T1GPPS
extern volatile unsigned char           T1GPPS              __at(0x3AC5);
#ifndef _LIB_BUILD
asm("T1GPPS equ 03AC5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1GPPS                 :6;
    };
} T1GPPSbits_t;
extern volatile T1GPPSbits_t T1GPPSbits __at(0x3AC5);
// bitfield macros
#define _T1GPPS_T1GPPS_POSN                                 0x0
#define _T1GPPS_T1GPPS_POSITION                             0x0
#define _T1GPPS_T1GPPS_SIZE                                 0x6
#define _T1GPPS_T1GPPS_LENGTH                               0x6
#define _T1GPPS_T1GPPS_MASK                                 0x3F

// Register: T3CKIPPS
#define T3CKIPPS T3CKIPPS
extern volatile unsigned char           T3CKIPPS            __at(0x3AC6);
#ifndef _LIB_BUILD
asm("T3CKIPPS equ 03AC6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T3CKIPPS               :6;
    };
} T3CKIPPSbits_t;
extern volatile T3CKIPPSbits_t T3CKIPPSbits __at(0x3AC6);
// bitfield macros
#define _T3CKIPPS_T3CKIPPS_POSN                             0x0
#define _T3CKIPPS_T3CKIPPS_POSITION                         0x0
#define _T3CKIPPS_T3CKIPPS_SIZE                             0x6
#define _T3CKIPPS_T3CKIPPS_LENGTH                           0x6
#define _T3CKIPPS_T3CKIPPS_MASK                             0x3F

// Register: T3GPPS
#define T3GPPS T3GPPS
extern volatile unsigned char           T3GPPS              __at(0x3AC7);
#ifndef _LIB_BUILD
asm("T3GPPS equ 03AC7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T3GPPS                 :6;
    };
} T3GPPSbits_t;
extern volatile T3GPPSbits_t T3GPPSbits __at(0x3AC7);
// bitfield macros
#define _T3GPPS_T3GPPS_POSN                                 0x0
#define _T3GPPS_T3GPPS_POSITION                             0x0
#define _T3GPPS_T3GPPS_SIZE                                 0x6
#define _T3GPPS_T3GPPS_LENGTH                               0x6
#define _T3GPPS_T3GPPS_MASK                                 0x3F

// Register: T5CKIPPS
#define T5CKIPPS T5CKIPPS
extern volatile unsigned char           T5CKIPPS            __at(0x3AC8);
#ifndef _LIB_BUILD
asm("T5CKIPPS equ 03AC8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T5CKIPPS               :6;
    };
} T5CKIPPSbits_t;
extern volatile T5CKIPPSbits_t T5CKIPPSbits __at(0x3AC8);
// bitfield macros
#define _T5CKIPPS_T5CKIPPS_POSN                             0x0
#define _T5CKIPPS_T5CKIPPS_POSITION                         0x0
#define _T5CKIPPS_T5CKIPPS_SIZE                             0x6
#define _T5CKIPPS_T5CKIPPS_LENGTH                           0x6
#define _T5CKIPPS_T5CKIPPS_MASK                             0x3F

// Register: T5GPPS
#define T5GPPS T5GPPS
extern volatile unsigned char           T5GPPS              __at(0x3AC9);
#ifndef _LIB_BUILD
asm("T5GPPS equ 03AC9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T5GPPS                 :6;
    };
} T5GPPSbits_t;
extern volatile T5GPPSbits_t T5GPPSbits __at(0x3AC9);
// bitfield macros
#define _T5GPPS_T5GPPS_POSN                                 0x0
#define _T5GPPS_T5GPPS_POSITION                             0x0
#define _T5GPPS_T5GPPS_SIZE                                 0x6
#define _T5GPPS_T5GPPS_LENGTH                               0x6
#define _T5GPPS_T5GPPS_MASK                                 0x3F

