MikroElektronika/core_packages/PIC/XC8/def/PIC18LF56K42/mcu.h
extern volatile DMA1DSZLbits_t DMA1DSZLbits __at(0x3BEE);
// bitfield macros
#define _DMA1DSZL_DSZ_POSN                                  0x0
#define _DMA1DSZL_DSZ_POSITION                              0x0
#define _DMA1DSZL_DSZ_SIZE                                  0x8
#define _DMA1DSZL_DSZ_LENGTH                                0x8
#define _DMA1DSZL_DSZ_MASK                                  0xFF
#define _DMA1DSZL_DMA1DSZ_POSN                              0x0
#define _DMA1DSZL_DMA1DSZ_POSITION                          0x0
#define _DMA1DSZL_DMA1DSZ_SIZE                              0x8
#define _DMA1DSZL_DMA1DSZ_LENGTH                            0x8
#define _DMA1DSZL_DMA1DSZ_MASK                              0xFF
#define _DMA1DSZL_DSZ0_POSN                                 0x0
#define _DMA1DSZL_DSZ0_POSITION                             0x0
#define _DMA1DSZL_DSZ0_SIZE                                 0x1
#define _DMA1DSZL_DSZ0_LENGTH                               0x1
#define _DMA1DSZL_DSZ0_MASK                                 0x1
#define _DMA1DSZL_DSZ1_POSN                                 0x1
#define _DMA1DSZL_DSZ1_POSITION                             0x1
#define _DMA1DSZL_DSZ1_SIZE                                 0x1
#define _DMA1DSZL_DSZ1_LENGTH                               0x1
#define _DMA1DSZL_DSZ1_MASK                                 0x2
#define _DMA1DSZL_DSZ2_POSN                                 0x2
#define _DMA1DSZL_DSZ2_POSITION                             0x2
#define _DMA1DSZL_DSZ2_SIZE                                 0x1
#define _DMA1DSZL_DSZ2_LENGTH                               0x1
#define _DMA1DSZL_DSZ2_MASK                                 0x4
#define _DMA1DSZL_DSZ3_POSN                                 0x3
#define _DMA1DSZL_DSZ3_POSITION                             0x3
#define _DMA1DSZL_DSZ3_SIZE                                 0x1
#define _DMA1DSZL_DSZ3_LENGTH                               0x1
#define _DMA1DSZL_DSZ3_MASK                                 0x8
#define _DMA1DSZL_DSZ4_POSN                                 0x4
#define _DMA1DSZL_DSZ4_POSITION                             0x4
#define _DMA1DSZL_DSZ4_SIZE                                 0x1
#define _DMA1DSZL_DSZ4_LENGTH                               0x1
#define _DMA1DSZL_DSZ4_MASK                                 0x10
#define _DMA1DSZL_DSZ5_POSN                                 0x5
#define _DMA1DSZL_DSZ5_POSITION                             0x5
#define _DMA1DSZL_DSZ5_SIZE                                 0x1
#define _DMA1DSZL_DSZ5_LENGTH                               0x1
#define _DMA1DSZL_DSZ5_MASK                                 0x20
#define _DMA1DSZL_DSZ6_POSN                                 0x6
#define _DMA1DSZL_DSZ6_POSITION                             0x6
#define _DMA1DSZL_DSZ6_SIZE                                 0x1
#define _DMA1DSZL_DSZ6_LENGTH                               0x1
#define _DMA1DSZL_DSZ6_MASK                                 0x40
#define _DMA1DSZL_DSZ7_POSN                                 0x7
#define _DMA1DSZL_DSZ7_POSITION                             0x7
#define _DMA1DSZL_DSZ7_SIZE                                 0x1
#define _DMA1DSZL_DSZ7_LENGTH                               0x1
#define _DMA1DSZL_DSZ7_MASK                                 0x80
#define _DMA1DSZL_DMA1DSZ0_POSN                             0x0
#define _DMA1DSZL_DMA1DSZ0_POSITION                         0x0
#define _DMA1DSZL_DMA1DSZ0_SIZE                             0x1
#define _DMA1DSZL_DMA1DSZ0_LENGTH                           0x1
#define _DMA1DSZL_DMA1DSZ0_MASK                             0x1
#define _DMA1DSZL_DMA1DSZ1_POSN                             0x1
#define _DMA1DSZL_DMA1DSZ1_POSITION                         0x1
#define _DMA1DSZL_DMA1DSZ1_SIZE                             0x1
#define _DMA1DSZL_DMA1DSZ1_LENGTH                           0x1
#define _DMA1DSZL_DMA1DSZ1_MASK                             0x2
#define _DMA1DSZL_DMA1DSZ2_POSN                             0x2
#define _DMA1DSZL_DMA1DSZ2_POSITION                         0x2
#define _DMA1DSZL_DMA1DSZ2_SIZE                             0x1
#define _DMA1DSZL_DMA1DSZ2_LENGTH                           0x1
#define _DMA1DSZL_DMA1DSZ2_MASK                             0x4
#define _DMA1DSZL_DMA1DSZ3_POSN                             0x3
#define _DMA1DSZL_DMA1DSZ3_POSITION                         0x3
#define _DMA1DSZL_DMA1DSZ3_SIZE                             0x1
#define _DMA1DSZL_DMA1DSZ3_LENGTH                           0x1
#define _DMA1DSZL_DMA1DSZ3_MASK                             0x8
#define _DMA1DSZL_DMA1DSZ4_POSN                             0x4
#define _DMA1DSZL_DMA1DSZ4_POSITION                         0x4
#define _DMA1DSZL_DMA1DSZ4_SIZE                             0x1
#define _DMA1DSZL_DMA1DSZ4_LENGTH                           0x1
#define _DMA1DSZL_DMA1DSZ4_MASK                             0x10
#define _DMA1DSZL_DMA1DSZ5_POSN                             0x5
#define _DMA1DSZL_DMA1DSZ5_POSITION                         0x5
#define _DMA1DSZL_DMA1DSZ5_SIZE                             0x1
#define _DMA1DSZL_DMA1DSZ5_LENGTH                           0x1
#define _DMA1DSZL_DMA1DSZ5_MASK                             0x20
#define _DMA1DSZL_DMA1DSZ6_POSN                             0x6
#define _DMA1DSZL_DMA1DSZ6_POSITION                         0x6
#define _DMA1DSZL_DMA1DSZ6_SIZE                             0x1
#define _DMA1DSZL_DMA1DSZ6_LENGTH                           0x1
#define _DMA1DSZL_DMA1DSZ6_MASK                             0x40
#define _DMA1DSZL_DMA1DSZ7_POSN                             0x7
#define _DMA1DSZL_DMA1DSZ7_POSITION                         0x7
#define _DMA1DSZL_DMA1DSZ7_SIZE                             0x1
#define _DMA1DSZL_DMA1DSZ7_LENGTH                           0x1
#define _DMA1DSZL_DMA1DSZ7_MASK                             0x80

// Register: DMA1DSZH
#define DMA1DSZH DMA1DSZH
extern volatile unsigned char           DMA1DSZH            __at(0x3BEF);
#ifndef _LIB_BUILD
asm("DMA1DSZH equ 03BEFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSZ                    :4;
    };
    struct {
        unsigned DMA1DSZ                :4;
    };
    struct {
        unsigned DSZ8                   :1;
        unsigned DSZ9                   :1;
        unsigned DSZ10                  :1;
        unsigned DSZ11                  :1;
    };
    struct {
        unsigned DMA1DSZ8               :1;
        unsigned DMA1DSZ9               :1;
        unsigned DMA1DSZ10              :1;
        unsigned DMA1DSZ11              :1;
    };
} DMA1DSZHbits_t;
extern volatile DMA1DSZHbits_t DMA1DSZHbits __at(0x3BEF);
// bitfield macros
#define _DMA1DSZH_DSZ_POSN                                  0x0
#define _DMA1DSZH_DSZ_POSITION                              0x0
#define _DMA1DSZH_DSZ_SIZE                                  0x4
#define _DMA1DSZH_DSZ_LENGTH                                0x4
#define _DMA1DSZH_DSZ_MASK                                  0xF
#define _DMA1DSZH_DMA1DSZ_POSN                              0x0
#define _DMA1DSZH_DMA1DSZ_POSITION                          0x0
#define _DMA1DSZH_DMA1DSZ_SIZE                              0x4
#define _DMA1DSZH_DMA1DSZ_LENGTH                            0x4
#define _DMA1DSZH_DMA1DSZ_MASK                              0xF
#define _DMA1DSZH_DSZ8_POSN                                 0x0
#define _DMA1DSZH_DSZ8_POSITION                             0x0
#define _DMA1DSZH_DSZ8_SIZE                                 0x1
#define _DMA1DSZH_DSZ8_LENGTH                               0x1
#define _DMA1DSZH_DSZ8_MASK                                 0x1
#define _DMA1DSZH_DSZ9_POSN                                 0x1
#define _DMA1DSZH_DSZ9_POSITION                             0x1
#define _DMA1DSZH_DSZ9_SIZE                                 0x1
#define _DMA1DSZH_DSZ9_LENGTH                               0x1
#define _DMA1DSZH_DSZ9_MASK                                 0x2
#define _DMA1DSZH_DSZ10_POSN                                0x2
#define _DMA1DSZH_DSZ10_POSITION                            0x2
#define _DMA1DSZH_DSZ10_SIZE                                0x1
#define _DMA1DSZH_DSZ10_LENGTH                              0x1
#define _DMA1DSZH_DSZ10_MASK                                0x4
#define _DMA1DSZH_DSZ11_POSN                                0x3
#define _DMA1DSZH_DSZ11_POSITION                            0x3
#define _DMA1DSZH_DSZ11_SIZE                                0x1
#define _DMA1DSZH_DSZ11_LENGTH                              0x1
#define _DMA1DSZH_DSZ11_MASK                                0x8
#define _DMA1DSZH_DMA1DSZ8_POSN                             0x0
#define _DMA1DSZH_DMA1DSZ8_POSITION                         0x0
#define _DMA1DSZH_DMA1DSZ8_SIZE                             0x1
#define _DMA1DSZH_DMA1DSZ8_LENGTH                           0x1
#define _DMA1DSZH_DMA1DSZ8_MASK                             0x1
#define _DMA1DSZH_DMA1DSZ9_POSN                             0x1
#define _DMA1DSZH_DMA1DSZ9_POSITION                         0x1
#define _DMA1DSZH_DMA1DSZ9_SIZE                             0x1
#define _DMA1DSZH_DMA1DSZ9_LENGTH                           0x1
#define _DMA1DSZH_DMA1DSZ9_MASK                             0x2
#define _DMA1DSZH_DMA1DSZ10_POSN                            0x2
#define _DMA1DSZH_DMA1DSZ10_POSITION                        0x2
#define _DMA1DSZH_DMA1DSZ10_SIZE                            0x1
#define _DMA1DSZH_DMA1DSZ10_LENGTH                          0x1
#define _DMA1DSZH_DMA1DSZ10_MASK                            0x4
#define _DMA1DSZH_DMA1DSZ11_POSN                            0x3
#define _DMA1DSZH_DMA1DSZ11_POSITION                        0x3
#define _DMA1DSZH_DMA1DSZ11_SIZE                            0x1
#define _DMA1DSZH_DMA1DSZ11_LENGTH                          0x1
#define _DMA1DSZH_DMA1DSZ11_MASK                            0x8

// Register: DMA1DSA
#define DMA1DSA DMA1DSA
extern volatile unsigned short          DMA1DSA             __at(0x3BF0);
#ifndef _LIB_BUILD
asm("DMA1DSA equ 03BF0h");
#endif

// Register: DMA1DSAL
#define DMA1DSAL DMA1DSAL
extern volatile unsigned char           DMA1DSAL            __at(0x3BF0);
#ifndef _LIB_BUILD
asm("DMA1DSAL equ 03BF0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSA                    :8;
    };
    struct {
        unsigned DSA0                   :1;
        unsigned DSA1                   :1;
        unsigned DSA2                   :1;
        unsigned DSA3                   :1;
        unsigned DSA4                   :1;
        unsigned DSA5                   :1;
        unsigned DSA6                   :1;
        unsigned DSA7                   :1;
    };
    struct {
        unsigned DMA1DSA                :8;
    };
    struct {
        unsigned DMA1DSA0               :1;
        unsigned DMA1DSA1               :1;
        unsigned DMA1DSA2               :1;
        unsigned DMA1DSA3               :1;
        unsigned DMA1DSA4               :1;
        unsigned DMA1DSA5               :1;
        unsigned DMA1DSA6               :1;
        unsigned DMA1DSA7               :1;
    };
} DMA1DSALbits_t;
extern volatile DMA1DSALbits_t DMA1DSALbits __at(0x3BF0);
// bitfield macros
#define _DMA1DSAL_DSA_POSN                                  0x0
#define _DMA1DSAL_DSA_POSITION                              0x0
#define _DMA1DSAL_DSA_SIZE                                  0x8
#define _DMA1DSAL_DSA_LENGTH                                0x8
#define _DMA1DSAL_DSA_MASK                                  0xFF
#define _DMA1DSAL_DSA0_POSN                                 0x0
#define _DMA1DSAL_DSA0_POSITION                             0x0
#define _DMA1DSAL_DSA0_SIZE                                 0x1
#define _DMA1DSAL_DSA0_LENGTH                               0x1
#define _DMA1DSAL_DSA0_MASK                                 0x1
#define _DMA1DSAL_DSA1_POSN                                 0x1
#define _DMA1DSAL_DSA1_POSITION                             0x1
#define _DMA1DSAL_DSA1_SIZE                                 0x1
#define _DMA1DSAL_DSA1_LENGTH                               0x1
#define _DMA1DSAL_DSA1_MASK                                 0x2
#define _DMA1DSAL_DSA2_POSN                                 0x2
#define _DMA1DSAL_DSA2_POSITION                             0x2
#define _DMA1DSAL_DSA2_SIZE                                 0x1
#define _DMA1DSAL_DSA2_LENGTH                               0x1
#define _DMA1DSAL_DSA2_MASK                                 0x4
#define _DMA1DSAL_DSA3_POSN                                 0x3
#define _DMA1DSAL_DSA3_POSITION                             0x3
#define _DMA1DSAL_DSA3_SIZE                                 0x1
#define _DMA1DSAL_DSA3_LENGTH                               0x1
#define _DMA1DSAL_DSA3_MASK                                 0x8
#define _DMA1DSAL_DSA4_POSN                                 0x4
#define _DMA1DSAL_DSA4_POSITION                             0x4
#define _DMA1DSAL_DSA4_SIZE                                 0x1
#define _DMA1DSAL_DSA4_LENGTH                               0x1
#define _DMA1DSAL_DSA4_MASK                                 0x10
#define _DMA1DSAL_DSA5_POSN                                 0x5
#define _DMA1DSAL_DSA5_POSITION                             0x5
#define _DMA1DSAL_DSA5_SIZE                                 0x1
#define _DMA1DSAL_DSA5_LENGTH                               0x1
#define _DMA1DSAL_DSA5_MASK                                 0x20
#define _DMA1DSAL_DSA6_POSN                                 0x6
#define _DMA1DSAL_DSA6_POSITION                             0x6
#define _DMA1DSAL_DSA6_SIZE                                 0x1
#define _DMA1DSAL_DSA6_LENGTH                               0x1
#define _DMA1DSAL_DSA6_MASK                                 0x40
#define _DMA1DSAL_DSA7_POSN                                 0x7
#define _DMA1DSAL_DSA7_POSITION                             0x7
#define _DMA1DSAL_DSA7_SIZE                                 0x1
#define _DMA1DSAL_DSA7_LENGTH                               0x1
#define _DMA1DSAL_DSA7_MASK                                 0x80
#define _DMA1DSAL_DMA1DSA_POSN                              0x0
#define _DMA1DSAL_DMA1DSA_POSITION                          0x0
#define _DMA1DSAL_DMA1DSA_SIZE                              0x8
#define _DMA1DSAL_DMA1DSA_LENGTH                            0x8
#define _DMA1DSAL_DMA1DSA_MASK                              0xFF
#define _DMA1DSAL_DMA1DSA0_POSN                             0x0
#define _DMA1DSAL_DMA1DSA0_POSITION                         0x0
#define _DMA1DSAL_DMA1DSA0_SIZE                             0x1
#define _DMA1DSAL_DMA1DSA0_LENGTH                           0x1
#define _DMA1DSAL_DMA1DSA0_MASK                             0x1
#define _DMA1DSAL_DMA1DSA1_POSN                             0x1
#define _DMA1DSAL_DMA1DSA1_POSITION                         0x1
#define _DMA1DSAL_DMA1DSA1_SIZE                             0x1
#define _DMA1DSAL_DMA1DSA1_LENGTH                           0x1
#define _DMA1DSAL_DMA1DSA1_MASK                             0x2
#define _DMA1DSAL_DMA1DSA2_POSN                             0x2
#define _DMA1DSAL_DMA1DSA2_POSITION                         0x2
#define _DMA1DSAL_DMA1DSA2_SIZE                             0x1
#define _DMA1DSAL_DMA1DSA2_LENGTH                           0x1
#define _DMA1DSAL_DMA1DSA2_MASK                             0x4
#define _DMA1DSAL_DMA1DSA3_POSN                             0x3
#define _DMA1DSAL_DMA1DSA3_POSITION                         0x3
#define _DMA1DSAL_DMA1DSA3_SIZE                             0x1
#define _DMA1DSAL_DMA1DSA3_LENGTH                           0x1
#define _DMA1DSAL_DMA1DSA3_MASK                             0x8
#define _DMA1DSAL_DMA1DSA4_POSN                             0x4
#define _DMA1DSAL_DMA1DSA4_POSITION                         0x4
#define _DMA1DSAL_DMA1DSA4_SIZE                             0x1
#define _DMA1DSAL_DMA1DSA4_LENGTH                           0x1
#define _DMA1DSAL_DMA1DSA4_MASK                             0x10
#define _DMA1DSAL_DMA1DSA5_POSN                             0x5
#define _DMA1DSAL_DMA1DSA5_POSITION                         0x5
#define _DMA1DSAL_DMA1DSA5_SIZE                             0x1
#define _DMA1DSAL_DMA1DSA5_LENGTH                           0x1
#define _DMA1DSAL_DMA1DSA5_MASK                             0x20
#define _DMA1DSAL_DMA1DSA6_POSN                             0x6
#define _DMA1DSAL_DMA1DSA6_POSITION                         0x6
#define _DMA1DSAL_DMA1DSA6_SIZE                             0x1
#define _DMA1DSAL_DMA1DSA6_LENGTH                           0x1
#define _DMA1DSAL_DMA1DSA6_MASK                             0x40
#define _DMA1DSAL_DMA1DSA7_POSN                             0x7
#define _DMA1DSAL_DMA1DSA7_POSITION                         0x7
#define _DMA1DSAL_DMA1DSA7_SIZE                             0x1
#define _DMA1DSAL_DMA1DSA7_LENGTH                           0x1
#define _DMA1DSAL_DMA1DSA7_MASK                             0x80

