MikroElektronika/core_packages/PIC/XC8/def/PIC18LF56K42/mcu.h
// Register: DMA1SCNTL
#define DMA1SCNTL DMA1SCNTL
extern volatile unsigned char           DMA1SCNTL           __at(0x3BF2);
#ifndef _LIB_BUILD
asm("DMA1SCNTL equ 03BF2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCNT                   :8;
    };
    struct {
        unsigned SCNT0                  :1;
        unsigned SCNT1                  :1;
        unsigned SCNT2                  :1;
        unsigned SCNT3                  :1;
        unsigned SCNT4                  :1;
        unsigned SCNT5                  :1;
        unsigned SCNT6                  :1;
        unsigned SCNT7                  :1;
    };
    struct {
        unsigned DMA1SCNT               :8;
    };
    struct {
        unsigned DMA1SCNT0              :1;
        unsigned DMA1SCNT1              :1;
        unsigned DMA1SCNT2              :1;
        unsigned DMA1SCNT3              :1;
        unsigned DMA1SCNT4              :1;
        unsigned DMA1SCNT5              :1;
        unsigned DMA1SCNT6              :1;
        unsigned DMA1SCNT7              :1;
    };
} DMA1SCNTLbits_t;
extern volatile DMA1SCNTLbits_t DMA1SCNTLbits __at(0x3BF2);
// bitfield macros
#define _DMA1SCNTL_SCNT_POSN                                0x0
#define _DMA1SCNTL_SCNT_POSITION                            0x0
#define _DMA1SCNTL_SCNT_SIZE                                0x8
#define _DMA1SCNTL_SCNT_LENGTH                              0x8
#define _DMA1SCNTL_SCNT_MASK                                0xFF
#define _DMA1SCNTL_SCNT0_POSN                               0x0
#define _DMA1SCNTL_SCNT0_POSITION                           0x0
#define _DMA1SCNTL_SCNT0_SIZE                               0x1
#define _DMA1SCNTL_SCNT0_LENGTH                             0x1
#define _DMA1SCNTL_SCNT0_MASK                               0x1
#define _DMA1SCNTL_SCNT1_POSN                               0x1
#define _DMA1SCNTL_SCNT1_POSITION                           0x1
#define _DMA1SCNTL_SCNT1_SIZE                               0x1
#define _DMA1SCNTL_SCNT1_LENGTH                             0x1
#define _DMA1SCNTL_SCNT1_MASK                               0x2
#define _DMA1SCNTL_SCNT2_POSN                               0x2
#define _DMA1SCNTL_SCNT2_POSITION                           0x2
#define _DMA1SCNTL_SCNT2_SIZE                               0x1
#define _DMA1SCNTL_SCNT2_LENGTH                             0x1
#define _DMA1SCNTL_SCNT2_MASK                               0x4
#define _DMA1SCNTL_SCNT3_POSN                               0x3
#define _DMA1SCNTL_SCNT3_POSITION                           0x3
#define _DMA1SCNTL_SCNT3_SIZE                               0x1
#define _DMA1SCNTL_SCNT3_LENGTH                             0x1
#define _DMA1SCNTL_SCNT3_MASK                               0x8
#define _DMA1SCNTL_SCNT4_POSN                               0x4
#define _DMA1SCNTL_SCNT4_POSITION                           0x4
#define _DMA1SCNTL_SCNT4_SIZE                               0x1
#define _DMA1SCNTL_SCNT4_LENGTH                             0x1
#define _DMA1SCNTL_SCNT4_MASK                               0x10
#define _DMA1SCNTL_SCNT5_POSN                               0x5
#define _DMA1SCNTL_SCNT5_POSITION                           0x5
#define _DMA1SCNTL_SCNT5_SIZE                               0x1
#define _DMA1SCNTL_SCNT5_LENGTH                             0x1
#define _DMA1SCNTL_SCNT5_MASK                               0x20
#define _DMA1SCNTL_SCNT6_POSN                               0x6
#define _DMA1SCNTL_SCNT6_POSITION                           0x6
#define _DMA1SCNTL_SCNT6_SIZE                               0x1
#define _DMA1SCNTL_SCNT6_LENGTH                             0x1
#define _DMA1SCNTL_SCNT6_MASK                               0x40
#define _DMA1SCNTL_SCNT7_POSN                               0x7
#define _DMA1SCNTL_SCNT7_POSITION                           0x7
#define _DMA1SCNTL_SCNT7_SIZE                               0x1
#define _DMA1SCNTL_SCNT7_LENGTH                             0x1
#define _DMA1SCNTL_SCNT7_MASK                               0x80
#define _DMA1SCNTL_DMA1SCNT_POSN                            0x0
#define _DMA1SCNTL_DMA1SCNT_POSITION                        0x0
#define _DMA1SCNTL_DMA1SCNT_SIZE                            0x8
#define _DMA1SCNTL_DMA1SCNT_LENGTH                          0x8
#define _DMA1SCNTL_DMA1SCNT_MASK                            0xFF
#define _DMA1SCNTL_DMA1SCNT0_POSN                           0x0
#define _DMA1SCNTL_DMA1SCNT0_POSITION                       0x0
#define _DMA1SCNTL_DMA1SCNT0_SIZE                           0x1
#define _DMA1SCNTL_DMA1SCNT0_LENGTH                         0x1
#define _DMA1SCNTL_DMA1SCNT0_MASK                           0x1
#define _DMA1SCNTL_DMA1SCNT1_POSN                           0x1
#define _DMA1SCNTL_DMA1SCNT1_POSITION                       0x1
#define _DMA1SCNTL_DMA1SCNT1_SIZE                           0x1
#define _DMA1SCNTL_DMA1SCNT1_LENGTH                         0x1
#define _DMA1SCNTL_DMA1SCNT1_MASK                           0x2
#define _DMA1SCNTL_DMA1SCNT2_POSN                           0x2
#define _DMA1SCNTL_DMA1SCNT2_POSITION                       0x2
#define _DMA1SCNTL_DMA1SCNT2_SIZE                           0x1
#define _DMA1SCNTL_DMA1SCNT2_LENGTH                         0x1
#define _DMA1SCNTL_DMA1SCNT2_MASK                           0x4
#define _DMA1SCNTL_DMA1SCNT3_POSN                           0x3
#define _DMA1SCNTL_DMA1SCNT3_POSITION                       0x3
#define _DMA1SCNTL_DMA1SCNT3_SIZE                           0x1
#define _DMA1SCNTL_DMA1SCNT3_LENGTH                         0x1
#define _DMA1SCNTL_DMA1SCNT3_MASK                           0x8
#define _DMA1SCNTL_DMA1SCNT4_POSN                           0x4
#define _DMA1SCNTL_DMA1SCNT4_POSITION                       0x4
#define _DMA1SCNTL_DMA1SCNT4_SIZE                           0x1
#define _DMA1SCNTL_DMA1SCNT4_LENGTH                         0x1
#define _DMA1SCNTL_DMA1SCNT4_MASK                           0x10
#define _DMA1SCNTL_DMA1SCNT5_POSN                           0x5
#define _DMA1SCNTL_DMA1SCNT5_POSITION                       0x5
#define _DMA1SCNTL_DMA1SCNT5_SIZE                           0x1
#define _DMA1SCNTL_DMA1SCNT5_LENGTH                         0x1
#define _DMA1SCNTL_DMA1SCNT5_MASK                           0x20
#define _DMA1SCNTL_DMA1SCNT6_POSN                           0x6
#define _DMA1SCNTL_DMA1SCNT6_POSITION                       0x6
#define _DMA1SCNTL_DMA1SCNT6_SIZE                           0x1
#define _DMA1SCNTL_DMA1SCNT6_LENGTH                         0x1
#define _DMA1SCNTL_DMA1SCNT6_MASK                           0x40
#define _DMA1SCNTL_DMA1SCNT7_POSN                           0x7
#define _DMA1SCNTL_DMA1SCNT7_POSITION                       0x7
#define _DMA1SCNTL_DMA1SCNT7_SIZE                           0x1
#define _DMA1SCNTL_DMA1SCNT7_LENGTH                         0x1
#define _DMA1SCNTL_DMA1SCNT7_MASK                           0x80

// Register: DMA1SCNTH
#define DMA1SCNTH DMA1SCNTH
extern volatile unsigned char           DMA1SCNTH           __at(0x3BF3);
#ifndef _LIB_BUILD
asm("DMA1SCNTH equ 03BF3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCNT                   :4;
    };
    struct {
        unsigned SCNT8                  :1;
        unsigned SCNT9                  :1;
        unsigned SCNT10                 :1;
        unsigned SCNT11                 :1;
    };
    struct {
        unsigned DMA1SCNT               :4;
    };
    struct {
        unsigned DMA1SCNT8              :1;
        unsigned DMA1SCNT9              :1;
        unsigned DMA1SCNT10             :1;
        unsigned DMA1SCNT11             :1;
    };
} DMA1SCNTHbits_t;
extern volatile DMA1SCNTHbits_t DMA1SCNTHbits __at(0x3BF3);
// bitfield macros
#define _DMA1SCNTH_SCNT_POSN                                0x0
#define _DMA1SCNTH_SCNT_POSITION                            0x0
#define _DMA1SCNTH_SCNT_SIZE                                0x4
#define _DMA1SCNTH_SCNT_LENGTH                              0x4
#define _DMA1SCNTH_SCNT_MASK                                0xF
#define _DMA1SCNTH_SCNT8_POSN                               0x0
#define _DMA1SCNTH_SCNT8_POSITION                           0x0
#define _DMA1SCNTH_SCNT8_SIZE                               0x1
#define _DMA1SCNTH_SCNT8_LENGTH                             0x1
#define _DMA1SCNTH_SCNT8_MASK                               0x1
#define _DMA1SCNTH_SCNT9_POSN                               0x1
#define _DMA1SCNTH_SCNT9_POSITION                           0x1
#define _DMA1SCNTH_SCNT9_SIZE                               0x1
#define _DMA1SCNTH_SCNT9_LENGTH                             0x1
#define _DMA1SCNTH_SCNT9_MASK                               0x2
#define _DMA1SCNTH_SCNT10_POSN                              0x2
#define _DMA1SCNTH_SCNT10_POSITION                          0x2
#define _DMA1SCNTH_SCNT10_SIZE                              0x1
#define _DMA1SCNTH_SCNT10_LENGTH                            0x1
#define _DMA1SCNTH_SCNT10_MASK                              0x4
#define _DMA1SCNTH_SCNT11_POSN                              0x3
#define _DMA1SCNTH_SCNT11_POSITION                          0x3
#define _DMA1SCNTH_SCNT11_SIZE                              0x1
#define _DMA1SCNTH_SCNT11_LENGTH                            0x1
#define _DMA1SCNTH_SCNT11_MASK                              0x8
#define _DMA1SCNTH_DMA1SCNT_POSN                            0x0
#define _DMA1SCNTH_DMA1SCNT_POSITION                        0x0
#define _DMA1SCNTH_DMA1SCNT_SIZE                            0x4
#define _DMA1SCNTH_DMA1SCNT_LENGTH                          0x4
#define _DMA1SCNTH_DMA1SCNT_MASK                            0xF
#define _DMA1SCNTH_DMA1SCNT8_POSN                           0x0
#define _DMA1SCNTH_DMA1SCNT8_POSITION                       0x0
#define _DMA1SCNTH_DMA1SCNT8_SIZE                           0x1
#define _DMA1SCNTH_DMA1SCNT8_LENGTH                         0x1
#define _DMA1SCNTH_DMA1SCNT8_MASK                           0x1
#define _DMA1SCNTH_DMA1SCNT9_POSN                           0x1
#define _DMA1SCNTH_DMA1SCNT9_POSITION                       0x1
#define _DMA1SCNTH_DMA1SCNT9_SIZE                           0x1
#define _DMA1SCNTH_DMA1SCNT9_LENGTH                         0x1
#define _DMA1SCNTH_DMA1SCNT9_MASK                           0x2
#define _DMA1SCNTH_DMA1SCNT10_POSN                          0x2
#define _DMA1SCNTH_DMA1SCNT10_POSITION                      0x2
#define _DMA1SCNTH_DMA1SCNT10_SIZE                          0x1
#define _DMA1SCNTH_DMA1SCNT10_LENGTH                        0x1
#define _DMA1SCNTH_DMA1SCNT10_MASK                          0x4
#define _DMA1SCNTH_DMA1SCNT11_POSN                          0x3
#define _DMA1SCNTH_DMA1SCNT11_POSITION                      0x3
#define _DMA1SCNTH_DMA1SCNT11_SIZE                          0x1
#define _DMA1SCNTH_DMA1SCNT11_LENGTH                        0x1
#define _DMA1SCNTH_DMA1SCNT11_MASK                          0x8

// Register: DMA1SPTR
#define DMA1SPTR DMA1SPTR
#ifndef __CCI__
extern volatile __uint24                DMA1SPTR            __at(0x3BF4);
#endif
#ifndef _LIB_BUILD
asm("DMA1SPTR equ 03BF4h");
#endif

// Register: DMA1SPTRL
#define DMA1SPTRL DMA1SPTRL
extern volatile unsigned char           DMA1SPTRL           __at(0x3BF4);
#ifndef _LIB_BUILD
asm("DMA1SPTRL equ 03BF4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :8;
    };
    struct {
        unsigned SPTR0                  :1;
        unsigned SPTR1                  :1;
        unsigned SPTR2                  :1;
        unsigned SPTR3                  :1;
        unsigned SPTR4                  :1;
        unsigned SPTR5                  :1;
        unsigned SPTR6                  :1;
        unsigned SPTR7                  :1;
    };
    struct {
        unsigned DMA1SPTR               :8;
    };
    struct {
        unsigned DMA1SPTR0              :1;
        unsigned DMA1SPTR1              :1;
        unsigned DMA1SPTR2              :1;
        unsigned DMA1SPTR3              :1;
        unsigned DMA1SPTR4              :1;
        unsigned DMA1SPTR5              :1;
        unsigned DMA1SPTR6              :1;
        unsigned DMA1SPTR7              :1;
    };
} DMA1SPTRLbits_t;
extern volatile DMA1SPTRLbits_t DMA1SPTRLbits __at(0x3BF4);
// bitfield macros
#define _DMA1SPTRL_SPTR_POSN                                0x0
#define _DMA1SPTRL_SPTR_POSITION                            0x0
#define _DMA1SPTRL_SPTR_SIZE                                0x8
#define _DMA1SPTRL_SPTR_LENGTH                              0x8
#define _DMA1SPTRL_SPTR_MASK                                0xFF
#define _DMA1SPTRL_SPTR0_POSN                               0x0
#define _DMA1SPTRL_SPTR0_POSITION                           0x0
#define _DMA1SPTRL_SPTR0_SIZE                               0x1
#define _DMA1SPTRL_SPTR0_LENGTH                             0x1
#define _DMA1SPTRL_SPTR0_MASK                               0x1
#define _DMA1SPTRL_SPTR1_POSN                               0x1
#define _DMA1SPTRL_SPTR1_POSITION                           0x1
#define _DMA1SPTRL_SPTR1_SIZE                               0x1
#define _DMA1SPTRL_SPTR1_LENGTH                             0x1
#define _DMA1SPTRL_SPTR1_MASK                               0x2
#define _DMA1SPTRL_SPTR2_POSN                               0x2
#define _DMA1SPTRL_SPTR2_POSITION                           0x2
#define _DMA1SPTRL_SPTR2_SIZE                               0x1
#define _DMA1SPTRL_SPTR2_LENGTH                             0x1
#define _DMA1SPTRL_SPTR2_MASK                               0x4
#define _DMA1SPTRL_SPTR3_POSN                               0x3
#define _DMA1SPTRL_SPTR3_POSITION                           0x3
#define _DMA1SPTRL_SPTR3_SIZE                               0x1
#define _DMA1SPTRL_SPTR3_LENGTH                             0x1
#define _DMA1SPTRL_SPTR3_MASK                               0x8
#define _DMA1SPTRL_SPTR4_POSN                               0x4
#define _DMA1SPTRL_SPTR4_POSITION                           0x4
#define _DMA1SPTRL_SPTR4_SIZE                               0x1
#define _DMA1SPTRL_SPTR4_LENGTH                             0x1
#define _DMA1SPTRL_SPTR4_MASK                               0x10
#define _DMA1SPTRL_SPTR5_POSN                               0x5
#define _DMA1SPTRL_SPTR5_POSITION                           0x5
#define _DMA1SPTRL_SPTR5_SIZE                               0x1
#define _DMA1SPTRL_SPTR5_LENGTH                             0x1
#define _DMA1SPTRL_SPTR5_MASK                               0x20
#define _DMA1SPTRL_SPTR6_POSN                               0x6
#define _DMA1SPTRL_SPTR6_POSITION                           0x6
#define _DMA1SPTRL_SPTR6_SIZE                               0x1
#define _DMA1SPTRL_SPTR6_LENGTH                             0x1
#define _DMA1SPTRL_SPTR6_MASK                               0x40
#define _DMA1SPTRL_SPTR7_POSN                               0x7
#define _DMA1SPTRL_SPTR7_POSITION                           0x7
#define _DMA1SPTRL_SPTR7_SIZE                               0x1
#define _DMA1SPTRL_SPTR7_LENGTH                             0x1
#define _DMA1SPTRL_SPTR7_MASK                               0x80
#define _DMA1SPTRL_DMA1SPTR_POSN                            0x0
#define _DMA1SPTRL_DMA1SPTR_POSITION                        0x0
#define _DMA1SPTRL_DMA1SPTR_SIZE                            0x8
#define _DMA1SPTRL_DMA1SPTR_LENGTH                          0x8
#define _DMA1SPTRL_DMA1SPTR_MASK                            0xFF
#define _DMA1SPTRL_DMA1SPTR0_POSN                           0x0
#define _DMA1SPTRL_DMA1SPTR0_POSITION                       0x0
#define _DMA1SPTRL_DMA1SPTR0_SIZE                           0x1
#define _DMA1SPTRL_DMA1SPTR0_LENGTH                         0x1
#define _DMA1SPTRL_DMA1SPTR0_MASK                           0x1
#define _DMA1SPTRL_DMA1SPTR1_POSN                           0x1
#define _DMA1SPTRL_DMA1SPTR1_POSITION                       0x1
#define _DMA1SPTRL_DMA1SPTR1_SIZE                           0x1
#define _DMA1SPTRL_DMA1SPTR1_LENGTH                         0x1
#define _DMA1SPTRL_DMA1SPTR1_MASK                           0x2
#define _DMA1SPTRL_DMA1SPTR2_POSN                           0x2
#define _DMA1SPTRL_DMA1SPTR2_POSITION                       0x2
#define _DMA1SPTRL_DMA1SPTR2_SIZE                           0x1
#define _DMA1SPTRL_DMA1SPTR2_LENGTH                         0x1
#define _DMA1SPTRL_DMA1SPTR2_MASK                           0x4
#define _DMA1SPTRL_DMA1SPTR3_POSN                           0x3
#define _DMA1SPTRL_DMA1SPTR3_POSITION                       0x3
#define _DMA1SPTRL_DMA1SPTR3_SIZE                           0x1
#define _DMA1SPTRL_DMA1SPTR3_LENGTH                         0x1
#define _DMA1SPTRL_DMA1SPTR3_MASK                           0x8
#define _DMA1SPTRL_DMA1SPTR4_POSN                           0x4
#define _DMA1SPTRL_DMA1SPTR4_POSITION                       0x4
#define _DMA1SPTRL_DMA1SPTR4_SIZE                           0x1
#define _DMA1SPTRL_DMA1SPTR4_LENGTH                         0x1
#define _DMA1SPTRL_DMA1SPTR4_MASK                           0x10
#define _DMA1SPTRL_DMA1SPTR5_POSN                           0x5
#define _DMA1SPTRL_DMA1SPTR5_POSITION                       0x5
#define _DMA1SPTRL_DMA1SPTR5_SIZE                           0x1
#define _DMA1SPTRL_DMA1SPTR5_LENGTH                         0x1
#define _DMA1SPTRL_DMA1SPTR5_MASK                           0x20
#define _DMA1SPTRL_DMA1SPTR6_POSN                           0x6
#define _DMA1SPTRL_DMA1SPTR6_POSITION                       0x6
#define _DMA1SPTRL_DMA1SPTR6_SIZE                           0x1
#define _DMA1SPTRL_DMA1SPTR6_LENGTH                         0x1
#define _DMA1SPTRL_DMA1SPTR6_MASK                           0x40
#define _DMA1SPTRL_DMA1SPTR7_POSN                           0x7
#define _DMA1SPTRL_DMA1SPTR7_POSITION                       0x7
#define _DMA1SPTRL_DMA1SPTR7_SIZE                           0x1
#define _DMA1SPTRL_DMA1SPTR7_LENGTH                         0x1
#define _DMA1SPTRL_DMA1SPTR7_MASK                           0x80

