MikroElektronika/core_packages/PIC/XC8/def/PIC18LF56K42/mcu.h
#define                                 DMA2SIRQ4_bit       _BIT_ACCESS(DMA2SIRQ,4)
// DMA2SIRQ<DMA2SIRQ5>
extern volatile __bit                   DMA2SIRQ5           __at(0x1DEFD);	// @ (0x3BDF * 8 + 5)
#define                                 DMA2SIRQ5_bit       _BIT_ACCESS(DMA2SIRQ,5)
// DMA2SIRQ<DMA2SIRQ6>
extern volatile __bit                   DMA2SIRQ6           __at(0x1DEFE);	// @ (0x3BDF * 8 + 6)
#define                                 DMA2SIRQ6_bit       _BIT_ACCESS(DMA2SIRQ,6)
// DMA2CON0<DMA2SIRQEN>
extern volatile __bit                   DMA2SIRQEN          __at(0x1DEE6);	// @ (0x3BDC * 8 + 6)
#define                                 DMA2SIRQEN_bit      _BIT_ACCESS(DMA2CON0,6)
// DMA2SPTRL<DMA2SPTR0>
extern volatile __bit                   DMA2SPTR0           __at(0x1DEA0);	// @ (0x3BD4 * 8 + 0)
#define                                 DMA2SPTR0_bit       _BIT_ACCESS(DMA2SPTRL,0)
// DMA2SPTRL<DMA2SPTR1>
extern volatile __bit                   DMA2SPTR1           __at(0x1DEA1);	// @ (0x3BD4 * 8 + 1)
#define                                 DMA2SPTR1_bit       _BIT_ACCESS(DMA2SPTRL,1)
// DMA2SPTRH<DMA2SPTR10>
extern volatile __bit                   DMA2SPTR10          __at(0x1DEAA);	// @ (0x3BD5 * 8 + 2)
#define                                 DMA2SPTR10_bit      _BIT_ACCESS(DMA2SPTRH,2)
// DMA2SPTRH<DMA2SPTR11>
extern volatile __bit                   DMA2SPTR11          __at(0x1DEAB);	// @ (0x3BD5 * 8 + 3)
#define                                 DMA2SPTR11_bit      _BIT_ACCESS(DMA2SPTRH,3)
// DMA2SPTRH<DMA2SPTR12>
extern volatile __bit                   DMA2SPTR12          __at(0x1DEAC);	// @ (0x3BD5 * 8 + 4)
#define                                 DMA2SPTR12_bit      _BIT_ACCESS(DMA2SPTRH,4)
// DMA2SPTRH<DMA2SPTR13>
extern volatile __bit                   DMA2SPTR13          __at(0x1DEAD);	// @ (0x3BD5 * 8 + 5)
#define                                 DMA2SPTR13_bit      _BIT_ACCESS(DMA2SPTRH,5)
// DMA2SPTRH<DMA2SPTR14>
extern volatile __bit                   DMA2SPTR14          __at(0x1DEAE);	// @ (0x3BD5 * 8 + 6)
#define                                 DMA2SPTR14_bit      _BIT_ACCESS(DMA2SPTRH,6)
// DMA2SPTRH<DMA2SPTR15>
extern volatile __bit                   DMA2SPTR15          __at(0x1DEAF);	// @ (0x3BD5 * 8 + 7)
#define                                 DMA2SPTR15_bit      _BIT_ACCESS(DMA2SPTRH,7)
// DMA2SPTRU<DMA2SPTR16>
extern volatile __bit                   DMA2SPTR16          __at(0x1DEB0);	// @ (0x3BD6 * 8 + 0)
#define                                 DMA2SPTR16_bit      _BIT_ACCESS(DMA2SPTRU,0)
// DMA2SPTRU<DMA2SPTR17>
extern volatile __bit                   DMA2SPTR17          __at(0x1DEB1);	// @ (0x3BD6 * 8 + 1)
#define                                 DMA2SPTR17_bit      _BIT_ACCESS(DMA2SPTRU,1)
// DMA2SPTRU<DMA2SPTR18>
extern volatile __bit                   DMA2SPTR18          __at(0x1DEB2);	// @ (0x3BD6 * 8 + 2)
#define                                 DMA2SPTR18_bit      _BIT_ACCESS(DMA2SPTRU,2)
// DMA2SPTRU<DMA2SPTR19>
extern volatile __bit                   DMA2SPTR19          __at(0x1DEB3);	// @ (0x3BD6 * 8 + 3)
#define                                 DMA2SPTR19_bit      _BIT_ACCESS(DMA2SPTRU,3)
// DMA2SPTRL<DMA2SPTR2>
extern volatile __bit                   DMA2SPTR2           __at(0x1DEA2);	// @ (0x3BD4 * 8 + 2)
#define                                 DMA2SPTR2_bit       _BIT_ACCESS(DMA2SPTRL,2)
// DMA2SPTRU<DMA2SPTR20>
extern volatile __bit                   DMA2SPTR20          __at(0x1DEB4);	// @ (0x3BD6 * 8 + 4)
#define                                 DMA2SPTR20_bit      _BIT_ACCESS(DMA2SPTRU,4)
// DMA2SPTRU<DMA2SPTR21>
extern volatile __bit                   DMA2SPTR21          __at(0x1DEB5);	// @ (0x3BD6 * 8 + 5)
#define                                 DMA2SPTR21_bit      _BIT_ACCESS(DMA2SPTRU,5)
// DMA2SPTRL<DMA2SPTR3>
extern volatile __bit                   DMA2SPTR3           __at(0x1DEA3);	// @ (0x3BD4 * 8 + 3)
#define                                 DMA2SPTR3_bit       _BIT_ACCESS(DMA2SPTRL,3)
// DMA2SPTRL<DMA2SPTR4>
extern volatile __bit                   DMA2SPTR4           __at(0x1DEA4);	// @ (0x3BD4 * 8 + 4)
#define                                 DMA2SPTR4_bit       _BIT_ACCESS(DMA2SPTRL,4)
// DMA2SPTRL<DMA2SPTR5>
extern volatile __bit                   DMA2SPTR5           __at(0x1DEA5);	// @ (0x3BD4 * 8 + 5)
#define                                 DMA2SPTR5_bit       _BIT_ACCESS(DMA2SPTRL,5)
// DMA2SPTRL<DMA2SPTR6>
extern volatile __bit                   DMA2SPTR6           __at(0x1DEA6);	// @ (0x3BD4 * 8 + 6)
#define                                 DMA2SPTR6_bit       _BIT_ACCESS(DMA2SPTRL,6)
// DMA2SPTRL<DMA2SPTR7>
extern volatile __bit                   DMA2SPTR7           __at(0x1DEA7);	// @ (0x3BD4 * 8 + 7)
#define                                 DMA2SPTR7_bit       _BIT_ACCESS(DMA2SPTRL,7)
// DMA2SPTRH<DMA2SPTR8>
extern volatile __bit                   DMA2SPTR8           __at(0x1DEA8);	// @ (0x3BD5 * 8 + 0)
#define                                 DMA2SPTR8_bit       _BIT_ACCESS(DMA2SPTRH,0)
// DMA2SPTRH<DMA2SPTR9>
extern volatile __bit                   DMA2SPTR9           __at(0x1DEA9);	// @ (0x3BD5 * 8 + 1)
#define                                 DMA2SPTR9_bit       _BIT_ACCESS(DMA2SPTRH,1)
// DMA2SSAL<DMA2SSA0>
extern volatile __bit                   DMA2SSA0            __at(0x1DEC8);	// @ (0x3BD9 * 8 + 0)
#define                                 DMA2SSA0_bit        _BIT_ACCESS(DMA2SSAL,0)
// DMA2SSAL<DMA2SSA1>
extern volatile __bit                   DMA2SSA1            __at(0x1DEC9);	// @ (0x3BD9 * 8 + 1)
#define                                 DMA2SSA1_bit        _BIT_ACCESS(DMA2SSAL,1)
// DMA2SSAH<DMA2SSA10>
extern volatile __bit                   DMA2SSA10           __at(0x1DED2);	// @ (0x3BDA * 8 + 2)
#define                                 DMA2SSA10_bit       _BIT_ACCESS(DMA2SSAH,2)
// DMA2SSAH<DMA2SSA11>
extern volatile __bit                   DMA2SSA11           __at(0x1DED3);	// @ (0x3BDA * 8 + 3)
#define                                 DMA2SSA11_bit       _BIT_ACCESS(DMA2SSAH,3)
// DMA2SSAH<DMA2SSA12>
extern volatile __bit                   DMA2SSA12           __at(0x1DED4);	// @ (0x3BDA * 8 + 4)
#define                                 DMA2SSA12_bit       _BIT_ACCESS(DMA2SSAH,4)
// DMA2SSAH<DMA2SSA13>
extern volatile __bit                   DMA2SSA13           __at(0x1DED5);	// @ (0x3BDA * 8 + 5)
#define                                 DMA2SSA13_bit       _BIT_ACCESS(DMA2SSAH,5)
// DMA2SSAH<DMA2SSA14>
extern volatile __bit                   DMA2SSA14           __at(0x1DED6);	// @ (0x3BDA * 8 + 6)
#define                                 DMA2SSA14_bit       _BIT_ACCESS(DMA2SSAH,6)
// DMA2SSAH<DMA2SSA15>
extern volatile __bit                   DMA2SSA15           __at(0x1DED7);	// @ (0x3BDA * 8 + 7)
#define                                 DMA2SSA15_bit       _BIT_ACCESS(DMA2SSAH,7)
// DMA2SSAU<DMA2SSA16>
extern volatile __bit                   DMA2SSA16           __at(0x1DED8);	// @ (0x3BDB * 8 + 0)
#define                                 DMA2SSA16_bit       _BIT_ACCESS(DMA2SSAU,0)
// DMA2SSAU<DMA2SSA17>
extern volatile __bit                   DMA2SSA17           __at(0x1DED9);	// @ (0x3BDB * 8 + 1)
#define                                 DMA2SSA17_bit       _BIT_ACCESS(DMA2SSAU,1)
// DMA2SSAU<DMA2SSA18>
extern volatile __bit                   DMA2SSA18           __at(0x1DEDA);	// @ (0x3BDB * 8 + 2)
#define                                 DMA2SSA18_bit       _BIT_ACCESS(DMA2SSAU,2)
// DMA2SSAU<DMA2SSA19>
extern volatile __bit                   DMA2SSA19           __at(0x1DEDB);	// @ (0x3BDB * 8 + 3)
#define                                 DMA2SSA19_bit       _BIT_ACCESS(DMA2SSAU,3)
// DMA2SSAL<DMA2SSA2>
extern volatile __bit                   DMA2SSA2            __at(0x1DECA);	// @ (0x3BD9 * 8 + 2)
#define                                 DMA2SSA2_bit        _BIT_ACCESS(DMA2SSAL,2)
// DMA2SSAU<DMA2SSA20>
extern volatile __bit                   DMA2SSA20           __at(0x1DEDC);	// @ (0x3BDB * 8 + 4)
#define                                 DMA2SSA20_bit       _BIT_ACCESS(DMA2SSAU,4)
// DMA2SSAU<DMA2SSA21>
extern volatile __bit                   DMA2SSA21           __at(0x1DEDD);	// @ (0x3BDB * 8 + 5)
#define                                 DMA2SSA21_bit       _BIT_ACCESS(DMA2SSAU,5)
// DMA2SSAL<DMA2SSA3>
extern volatile __bit                   DMA2SSA3            __at(0x1DECB);	// @ (0x3BD9 * 8 + 3)
#define                                 DMA2SSA3_bit        _BIT_ACCESS(DMA2SSAL,3)
// DMA2SSAL<DMA2SSA4>
extern volatile __bit                   DMA2SSA4            __at(0x1DECC);	// @ (0x3BD9 * 8 + 4)
#define                                 DMA2SSA4_bit        _BIT_ACCESS(DMA2SSAL,4)
// DMA2SSAL<DMA2SSA5>
extern volatile __bit                   DMA2SSA5            __at(0x1DECD);	// @ (0x3BD9 * 8 + 5)
#define                                 DMA2SSA5_bit        _BIT_ACCESS(DMA2SSAL,5)
// DMA2SSAL<DMA2SSA6>
extern volatile __bit                   DMA2SSA6            __at(0x1DECE);	// @ (0x3BD9 * 8 + 6)
#define                                 DMA2SSA6_bit        _BIT_ACCESS(DMA2SSAL,6)
// DMA2SSAL<DMA2SSA7>
extern volatile __bit                   DMA2SSA7            __at(0x1DECF);	// @ (0x3BD9 * 8 + 7)
#define                                 DMA2SSA7_bit        _BIT_ACCESS(DMA2SSAL,7)
// DMA2SSAH<DMA2SSA8>
extern volatile __bit                   DMA2SSA8            __at(0x1DED0);	// @ (0x3BDA * 8 + 0)
#define                                 DMA2SSA8_bit        _BIT_ACCESS(DMA2SSAH,0)
// DMA2SSAH<DMA2SSA9>
extern volatile __bit                   DMA2SSA9            __at(0x1DED1);	// @ (0x3BDA * 8 + 1)
#define                                 DMA2SSA9_bit        _BIT_ACCESS(DMA2SSAH,1)
// DMA2SSZL<DMA2SSZ0>
extern volatile __bit                   DMA2SSZ0            __at(0x1DEB8);	// @ (0x3BD7 * 8 + 0)
#define                                 DMA2SSZ0_bit        _BIT_ACCESS(DMA2SSZL,0)
// DMA2SSZL<DMA2SSZ1>
extern volatile __bit                   DMA2SSZ1            __at(0x1DEB9);	// @ (0x3BD7 * 8 + 1)
#define                                 DMA2SSZ1_bit        _BIT_ACCESS(DMA2SSZL,1)
// DMA2SSZH<DMA2SSZ10>
extern volatile __bit                   DMA2SSZ10           __at(0x1DEC2);	// @ (0x3BD8 * 8 + 2)
#define                                 DMA2SSZ10_bit       _BIT_ACCESS(DMA2SSZH,2)
// DMA2SSZH<DMA2SSZ11>
extern volatile __bit                   DMA2SSZ11           __at(0x1DEC3);	// @ (0x3BD8 * 8 + 3)
#define                                 DMA2SSZ11_bit       _BIT_ACCESS(DMA2SSZH,3)
// DMA2SSZL<DMA2SSZ2>
extern volatile __bit                   DMA2SSZ2            __at(0x1DEBA);	// @ (0x3BD7 * 8 + 2)
#define                                 DMA2SSZ2_bit        _BIT_ACCESS(DMA2SSZL,2)
// DMA2SSZL<DMA2SSZ3>
extern volatile __bit                   DMA2SSZ3            __at(0x1DEBB);	// @ (0x3BD7 * 8 + 3)
#define                                 DMA2SSZ3_bit        _BIT_ACCESS(DMA2SSZL,3)
// DMA2SSZL<DMA2SSZ4>
extern volatile __bit                   DMA2SSZ4            __at(0x1DEBC);	// @ (0x3BD7 * 8 + 4)
#define                                 DMA2SSZ4_bit        _BIT_ACCESS(DMA2SSZL,4)
// DMA2SSZL<DMA2SSZ5>
extern volatile __bit                   DMA2SSZ5            __at(0x1DEBD);	// @ (0x3BD7 * 8 + 5)
#define                                 DMA2SSZ5_bit        _BIT_ACCESS(DMA2SSZL,5)
// DMA2SSZL<DMA2SSZ6>
extern volatile __bit                   DMA2SSZ6            __at(0x1DEBE);	// @ (0x3BD7 * 8 + 6)
#define                                 DMA2SSZ6_bit        _BIT_ACCESS(DMA2SSZL,6)
// DMA2SSZL<DMA2SSZ7>
extern volatile __bit                   DMA2SSZ7            __at(0x1DEBF);	// @ (0x3BD7 * 8 + 7)
#define                                 DMA2SSZ7_bit        _BIT_ACCESS(DMA2SSZL,7)
// DMA2SSZH<DMA2SSZ8>
extern volatile __bit                   DMA2SSZ8            __at(0x1DEC0);	// @ (0x3BD8 * 8 + 0)
#define                                 DMA2SSZ8_bit        _BIT_ACCESS(DMA2SSZH,0)
// DMA2SSZH<DMA2SSZ9>
extern volatile __bit                   DMA2SSZ9            __at(0x1DEC1);	// @ (0x3BD8 * 8 + 1)
#define                                 DMA2SSZ9_bit        _BIT_ACCESS(DMA2SSZH,1)
// DMA2CON0<DMA2XIP>
extern volatile __bit                   DMA2XIP             __at(0x1DEE0);	// @ (0x3BDC * 8 + 0)
#define                                 DMA2XIP_bit         _BIT_ACCESS(DMA2CON0,0)
// CPUDOZE<DOE>
extern volatile __bit                   DOE                 __at(0x1CEC4);	// @ (0x39D8 * 8 + 4)
#define                                 DOE_bit             _BIT_ACCESS(CPUDOZE,4)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x1F7C0);	// @ (0x3EF8 * 8 + 0)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,0)
// CPUDOZE<DOZE0>
extern volatile __bit                   DOZE0               __at(0x1CEC0);	// @ (0x39D8 * 8 + 0)
#define                                 DOZE0_bit           _BIT_ACCESS(CPUDOZE,0)
// CPUDOZE<DOZE1>
extern volatile __bit                   DOZE1               __at(0x1CEC1);	// @ (0x39D8 * 8 + 1)
#define                                 DOZE1_bit           _BIT_ACCESS(CPUDOZE,1)
// CPUDOZE<DOZE2>
extern volatile __bit                   DOZE2               __at(0x1CEC2);	// @ (0x39D8 * 8 + 2)
#define                                 DOZE2_bit           _BIT_ACCESS(CPUDOZE,2)
// CPUDOZE<DOZEN>
extern volatile __bit                   DOZEN               __at(0x1CEC6);	// @ (0x39D8 * 8 + 6)
#define                                 DOZEN_bit           _BIT_ACCESS(CPUDOZE,6)
// ADCON1<DSEN>
extern volatile __bit                   DSEN                __at(0x1F7C8);	// @ (0x3EF9 * 8 + 0)
#define                                 DSEN_bit            _BIT_ACCESS(ADCON1,0)
// PMD6<DSMMD>
extern volatile __bit                   DSMMD               __at(0x1CE30);	// @ (0x39C6 * 8 + 0)
#define                                 DSMMD_bit           _BIT_ACCESS(PMD6,0)
// SPI1INTE<EOSIE>
extern volatile __bit                   EOSIE               __at(0x1E8DC);	// @ (0x3D1B * 8 + 4)
#define                                 EOSIE_bit           _BIT_ACCESS(SPI1INTE,4)
// SPI1INTF<EOSIF>
extern volatile __bit                   EOSIF               __at(0x1E8D4);	// @ (0x3D1A * 8 + 4)
#define                                 EOSIF_bit           _BIT_ACCESS(SPI1INTF,4)
// ADERRL<ERR0>
extern volatile __bit                   ERR0                __at(0x1F710);	// @ (0x3EE2 * 8 + 0)
#define                                 ERR0_bit            _BIT_ACCESS(ADERRL,0)
// ADERRL<ERR1>
extern volatile __bit                   ERR1                __at(0x1F711);	// @ (0x3EE2 * 8 + 1)
#define                                 ERR1_bit            _BIT_ACCESS(ADERRL,1)
// ADERRH<ERR10>
extern volatile __bit                   ERR10               __at(0x1F71A);	// @ (0x3EE3 * 8 + 2)
#define                                 ERR10_bit           _BIT_ACCESS(ADERRH,2)
// ADERRH<ERR11>
extern volatile __bit                   ERR11               __at(0x1F71B);	// @ (0x3EE3 * 8 + 3)
#define                                 ERR11_bit           _BIT_ACCESS(ADERRH,3)
// ADERRH<ERR12>
extern volatile __bit                   ERR12               __at(0x1F71C);	// @ (0x3EE3 * 8 + 4)
#define                                 ERR12_bit           _BIT_ACCESS(ADERRH,4)
// ADERRH<ERR13>
extern volatile __bit                   ERR13               __at(0x1F71D);	// @ (0x3EE3 * 8 + 5)
#define                                 ERR13_bit           _BIT_ACCESS(ADERRH,5)
// ADERRH<ERR14>
extern volatile __bit                   ERR14               __at(0x1F71E);	// @ (0x3EE3 * 8 + 6)
#define                                 ERR14_bit           _BIT_ACCESS(ADERRH,6)
// ADERRH<ERR15>
extern volatile __bit                   ERR15               __at(0x1F71F);	// @ (0x3EE3 * 8 + 7)
#define                                 ERR15_bit           _BIT_ACCESS(ADERRH,7)
// ADERRL<ERR2>
extern volatile __bit                   ERR2                __at(0x1F712);	// @ (0x3EE2 * 8 + 2)
#define                                 ERR2_bit            _BIT_ACCESS(ADERRL,2)
// ADERRL<ERR3>
extern volatile __bit                   ERR3                __at(0x1F713);	// @ (0x3EE2 * 8 + 3)
#define                                 ERR3_bit            _BIT_ACCESS(ADERRL,3)
// ADERRL<ERR4>
extern volatile __bit                   ERR4                __at(0x1F714);	// @ (0x3EE2 * 8 + 4)
#define                                 ERR4_bit            _BIT_ACCESS(ADERRL,4)
// ADERRL<ERR5>
extern volatile __bit                   ERR5                __at(0x1F715);	// @ (0x3EE2 * 8 + 5)
#define                                 ERR5_bit            _BIT_ACCESS(ADERRL,5)
// ADERRL<ERR6>
extern volatile __bit                   ERR6                __at(0x1F716);	// @ (0x3EE2 * 8 + 6)
#define                                 ERR6_bit            _BIT_ACCESS(ADERRL,6)
// ADERRL<ERR7>
extern volatile __bit                   ERR7                __at(0x1F717);	// @ (0x3EE2 * 8 + 7)
#define                                 ERR7_bit            _BIT_ACCESS(ADERRL,7)
// ADERRH<ERR8>
extern volatile __bit                   ERR8                __at(0x1F718);	// @ (0x3EE3 * 8 + 0)
#define                                 ERR8_bit            _BIT_ACCESS(ADERRH,0)
// ADERRH<ERR9>
extern volatile __bit                   ERR9                __at(0x1F719);	// @ (0x3EE3 * 8 + 1)
#define                                 ERR9_bit            _BIT_ACCESS(ADERRH,1)
// OSCEN<EXTOEN>
extern volatile __bit                   EXTOEN              __at(0x1CEEF);	// @ (0x39DD * 8 + 7)
#define                                 EXTOEN_bit          _BIT_ACCESS(OSCEN,7)
// OSCSTAT<EXTOR>
extern volatile __bit                   EXTOR               __at(0x1CEE7);	// @ (0x39DC * 8 + 7)
#define                                 EXTOR_bit           _BIT_ACCESS(OSCSTAT,7)
// ADFLTRL<FLTR0>
extern volatile __bit                   FLTR0               __at(0x1F730);	// @ (0x3EE6 * 8 + 0)
#define                                 FLTR0_bit           _BIT_ACCESS(ADFLTRL,0)
// ADFLTRL<FLTR1>
extern volatile __bit                   FLTR1               __at(0x1F731);	// @ (0x3EE6 * 8 + 1)
#define                                 FLTR1_bit           _BIT_ACCESS(ADFLTRL,1)
// ADFLTRH<FLTR10>
extern volatile __bit                   FLTR10              __at(0x1F73A);	// @ (0x3EE7 * 8 + 2)
#define                                 FLTR10_bit          _BIT_ACCESS(ADFLTRH,2)
// ADFLTRH<FLTR11>
extern volatile __bit                   FLTR11              __at(0x1F73B);	// @ (0x3EE7 * 8 + 3)
#define                                 FLTR11_bit          _BIT_ACCESS(ADFLTRH,3)
// ADFLTRH<FLTR12>
extern volatile __bit                   FLTR12              __at(0x1F73C);	// @ (0x3EE7 * 8 + 4)
#define                                 FLTR12_bit          _BIT_ACCESS(ADFLTRH,4)
// ADFLTRH<FLTR13>
extern volatile __bit                   FLTR13              __at(0x1F73D);	// @ (0x3EE7 * 8 + 5)
#define                                 FLTR13_bit          _BIT_ACCESS(ADFLTRH,5)
// ADFLTRH<FLTR14>
extern volatile __bit                   FLTR14              __at(0x1F73E);	// @ (0x3EE7 * 8 + 6)
#define                                 FLTR14_bit          _BIT_ACCESS(ADFLTRH,6)
// ADFLTRH<FLTR15>
extern volatile __bit                   FLTR15              __at(0x1F73F);	// @ (0x3EE7 * 8 + 7)
#define                                 FLTR15_bit          _BIT_ACCESS(ADFLTRH,7)
// ADFLTRL<FLTR2>
extern volatile __bit                   FLTR2               __at(0x1F732);	// @ (0x3EE6 * 8 + 2)
#define                                 FLTR2_bit           _BIT_ACCESS(ADFLTRL,2)
// ADFLTRL<FLTR3>
extern volatile __bit                   FLTR3               __at(0x1F733);	// @ (0x3EE6 * 8 + 3)
#define                                 FLTR3_bit           _BIT_ACCESS(ADFLTRL,3)
// ADFLTRL<FLTR4>
extern volatile __bit                   FLTR4               __at(0x1F734);	// @ (0x3EE6 * 8 + 4)
#define                                 FLTR4_bit           _BIT_ACCESS(ADFLTRL,4)
// ADFLTRL<FLTR5>
extern volatile __bit                   FLTR5               __at(0x1F735);	// @ (0x3EE6 * 8 + 5)
#define                                 FLTR5_bit           _BIT_ACCESS(ADFLTRL,5)
// ADFLTRL<FLTR6>
extern volatile __bit                   FLTR6               __at(0x1F736);	// @ (0x3EE6 * 8 + 6)
#define                                 FLTR6_bit           _BIT_ACCESS(ADFLTRL,6)
// ADFLTRL<FLTR7>
extern volatile __bit                   FLTR7               __at(0x1F737);	// @ (0x3EE6 * 8 + 7)
#define                                 FLTR7_bit           _BIT_ACCESS(ADFLTRL,7)
// ADFLTRH<FLTR8>
extern volatile __bit                   FLTR8               __at(0x1F738);	// @ (0x3EE7 * 8 + 0)
#define                                 FLTR8_bit           _BIT_ACCESS(ADFLTRH,0)
// ADFLTRH<FLTR9>
extern volatile __bit                   FLTR9               __at(0x1F739);	// @ (0x3EE7 * 8 + 1)
#define                                 FLTR9_bit           _BIT_ACCESS(ADFLTRH,1)
// ADCON0<FM0>
extern volatile __bit                   FM0                 __at(0x1F7C2);	// @ (0x3EF8 * 8 + 2)
#define                                 FM0_bit             _BIT_ACCESS(ADCON0,2)
// NVMCON1<FREE>
extern volatile __bit                   FREE                __at(0x1CF2C);	// @ (0x39E5 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(NVMCON1,4)
// OSCFRQ<FRQ0>
extern volatile __bit                   FRQ0                __at(0x1CEF8);	// @ (0x39DF * 8 + 0)
#define                                 FRQ0_bit            _BIT_ACCESS(OSCFRQ,0)
// OSCFRQ<FRQ1>
extern volatile __bit                   FRQ1                __at(0x1CEF9);	// @ (0x39DF * 8 + 1)
#define                                 FRQ1_bit            _BIT_ACCESS(OSCFRQ,1)
// OSCFRQ<FRQ2>
extern volatile __bit                   FRQ2                __at(0x1CEFA);	// @ (0x39DF * 8 + 2)
#define                                 FRQ2_bit            _BIT_ACCESS(OSCFRQ,2)
// OSCFRQ<FRQ3>
extern volatile __bit                   FRQ3                __at(0x1CEFB);	// @ (0x39DF * 8 + 3)
#define                                 FRQ3_bit            _BIT_ACCESS(OSCFRQ,3)
// SPI1CON1<FST>
extern volatile __bit                   FST                 __at(0x1E8AC);	// @ (0x3D15 * 8 + 4)
#define                                 FST_bit             _BIT_ACCESS(SPI1CON1,4)
// CRCCON0<FULL>
extern volatile __bit                   FULL                __at(0x1CB40);	// @ (0x3968 * 8 + 0)
#define                                 FULL_bit            _BIT_ACCESS(CRCCON0,0)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x1F60F);	// @ (0x3EC1 * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// PMD0<FVRMD>
extern volatile __bit                   FVRMD               __at(0x1CE06);	// @ (0x39C0 * 8 + 6)
#define                                 FVRMD_bit           _BIT_ACCESS(PMD0,6)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x1F60E);	// @ (0x3EC1 * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// CWG1CON0<G1EN>
extern volatile __bit                   G1EN                __at(0x1FAB7);	// @ (0x3F56 * 8 + 7)
#define                                 G1EN_bit            _BIT_ACCESS(CWG1CON0,7)
// CWG2CON0<G2EN>
extern volatile __bit                   G2EN                __at(0x1FA6F);	// @ (0x3F4D * 8 + 7)
#define                                 G2EN_bit            _BIT_ACCESS(CWG2CON0,7)
// CWG3CON0<G3EN>
extern volatile __bit                   G3EN                __at(0x1FA27);	// @ (0x3F44 * 8 + 7)
#define                                 G3EN_bit            _BIT_ACCESS(CWG3CON0,7)
// INTCON0<GIE>
extern volatile __bit                   GIE                 __at(0x1FE97);	// @ (0x3FD2 * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON0,7)
// INTCON0<GIEH>
