MikroElektronika/core_packages/PIC/XC8/def/PIC18LF56K42/mcu.h
extern volatile __bit                   TMR5ON              __at(0x1FCD0);	// @ (0x3F9A * 8 + 0)
#define                                 TMR5ON_bit          _BIT_ACCESS(T5CON,0)
// PIE9<TMR6IE>
extern volatile __bit                   TMR6IE              __at(0x1CCC8);	// @ (0x3999 * 8 + 0)
#define                                 TMR6IE_bit          _BIT_ACCESS(PIE9,0)
// PIR9<TMR6IF>
extern volatile __bit                   TMR6IF              __at(0x1CD48);	// @ (0x39A9 * 8 + 0)
#define                                 TMR6IF_bit          _BIT_ACCESS(PIR9,0)
// IPR9<TMR6IP>
extern volatile __bit                   TMR6IP              __at(0x1CC48);	// @ (0x3989 * 8 + 0)
#define                                 TMR6IP_bit          _BIT_ACCESS(IPR9,0)
// PMD1<TMR6MD>
extern volatile __bit                   TMR6MD              __at(0x1CE0E);	// @ (0x39C1 * 8 + 6)
#define                                 TMR6MD_bit          _BIT_ACCESS(PMD1,6)
// T6CON<TMR6ON>
extern volatile __bit                   TMR6ON              __at(0x1FCA7);	// @ (0x3F94 * 8 + 7)
#define                                 TMR6ON_bit          _BIT_ACCESS(T6CON,7)
// SMT1TMRL<TMR7>
extern volatile __bit                   TMR7                __at(0x1F897);	// @ (0x3F12 * 8 + 7)
#define                                 TMR7_bit            _BIT_ACCESS(SMT1TMRL,7)
// SMT1TMRH<TMR8>
extern volatile __bit                   TMR8                __at(0x1F898);	// @ (0x3F13 * 8 + 0)
#define                                 TMR8_bit            _BIT_ACCESS(SMT1TMRH,0)
// SMT1TMRH<TMR9>
extern volatile __bit                   TMR9                __at(0x1F899);	// @ (0x3F13 * 8 + 1)
#define                                 TMR9_bit            _BIT_ACCESS(SMT1TMRH,1)
// SCANCON0<TRIGEN>
extern volatile __bit                   TRIGEN              __at(0x1CBE6);	// @ (0x397C * 8 + 6)
#define                                 TRIGEN_bit          _BIT_ACCESS(SCANCON0,6)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0x1FE10);	// @ (0x3FC2 * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0x1FE11);	// @ (0x3FC2 * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISA,1)
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0x1FE12);	// @ (0x3FC2 * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISA,2)
// TRISA<TRISA3>
extern volatile __bit                   TRISA3              __at(0x1FE13);	// @ (0x3FC2 * 8 + 3)
#define                                 TRISA3_bit          _BIT_ACCESS(TRISA,3)
// TRISA<TRISA4>
extern volatile __bit                   TRISA4              __at(0x1FE14);	// @ (0x3FC2 * 8 + 4)
#define                                 TRISA4_bit          _BIT_ACCESS(TRISA,4)
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0x1FE15);	// @ (0x3FC2 * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISA,5)
// TRISA<TRISA6>
extern volatile __bit                   TRISA6              __at(0x1FE16);	// @ (0x3FC2 * 8 + 6)
#define                                 TRISA6_bit          _BIT_ACCESS(TRISA,6)
// TRISA<TRISA7>
extern volatile __bit                   TRISA7              __at(0x1FE17);	// @ (0x3FC2 * 8 + 7)
#define                                 TRISA7_bit          _BIT_ACCESS(TRISA,7)
// TRISB<TRISB0>
extern volatile __bit                   TRISB0              __at(0x1FE18);	// @ (0x3FC3 * 8 + 0)
#define                                 TRISB0_bit          _BIT_ACCESS(TRISB,0)
// TRISB<TRISB1>
extern volatile __bit                   TRISB1              __at(0x1FE19);	// @ (0x3FC3 * 8 + 1)
#define                                 TRISB1_bit          _BIT_ACCESS(TRISB,1)
// TRISB<TRISB2>
extern volatile __bit                   TRISB2              __at(0x1FE1A);	// @ (0x3FC3 * 8 + 2)
#define                                 TRISB2_bit          _BIT_ACCESS(TRISB,2)
// TRISB<TRISB3>
extern volatile __bit                   TRISB3              __at(0x1FE1B);	// @ (0x3FC3 * 8 + 3)
#define                                 TRISB3_bit          _BIT_ACCESS(TRISB,3)
// TRISB<TRISB4>
extern volatile __bit                   TRISB4              __at(0x1FE1C);	// @ (0x3FC3 * 8 + 4)
#define                                 TRISB4_bit          _BIT_ACCESS(TRISB,4)
// TRISB<TRISB5>
extern volatile __bit                   TRISB5              __at(0x1FE1D);	// @ (0x3FC3 * 8 + 5)
#define                                 TRISB5_bit          _BIT_ACCESS(TRISB,5)
// TRISB<TRISB6>
extern volatile __bit                   TRISB6              __at(0x1FE1E);	// @ (0x3FC3 * 8 + 6)
#define                                 TRISB6_bit          _BIT_ACCESS(TRISB,6)
// TRISB<TRISB7>
extern volatile __bit                   TRISB7              __at(0x1FE1F);	// @ (0x3FC3 * 8 + 7)
#define                                 TRISB7_bit          _BIT_ACCESS(TRISB,7)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0x1FE20);	// @ (0x3FC4 * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0x1FE21);	// @ (0x3FC4 * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0x1FE22);	// @ (0x3FC4 * 8 + 2)
#define                                 TRISC2_bit          _BIT_ACCESS(TRISC,2)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0x1FE23);	// @ (0x3FC4 * 8 + 3)
#define                                 TRISC3_bit          _BIT_ACCESS(TRISC,3)
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0x1FE24);	// @ (0x3FC4 * 8 + 4)
#define                                 TRISC4_bit          _BIT_ACCESS(TRISC,4)
// TRISC<TRISC5>
extern volatile __bit                   TRISC5              __at(0x1FE25);	// @ (0x3FC4 * 8 + 5)
#define                                 TRISC5_bit          _BIT_ACCESS(TRISC,5)
// TRISC<TRISC6>
extern volatile __bit                   TRISC6              __at(0x1FE26);	// @ (0x3FC4 * 8 + 6)
#define                                 TRISC6_bit          _BIT_ACCESS(TRISC,6)
// TRISC<TRISC7>
extern volatile __bit                   TRISC7              __at(0x1FE27);	// @ (0x3FC4 * 8 + 7)
#define                                 TRISC7_bit          _BIT_ACCESS(TRISC,7)
// TRISD<TRISD0>
extern volatile __bit                   TRISD0              __at(0x1FE28);	// @ (0x3FC5 * 8 + 0)
#define                                 TRISD0_bit          _BIT_ACCESS(TRISD,0)
// TRISD<TRISD1>
extern volatile __bit                   TRISD1              __at(0x1FE29);	// @ (0x3FC5 * 8 + 1)
#define                                 TRISD1_bit          _BIT_ACCESS(TRISD,1)
// TRISD<TRISD2>
extern volatile __bit                   TRISD2              __at(0x1FE2A);	// @ (0x3FC5 * 8 + 2)
#define                                 TRISD2_bit          _BIT_ACCESS(TRISD,2)
// TRISD<TRISD3>
extern volatile __bit                   TRISD3              __at(0x1FE2B);	// @ (0x3FC5 * 8 + 3)
#define                                 TRISD3_bit          _BIT_ACCESS(TRISD,3)
// TRISD<TRISD4>
extern volatile __bit                   TRISD4              __at(0x1FE2C);	// @ (0x3FC5 * 8 + 4)
#define                                 TRISD4_bit          _BIT_ACCESS(TRISD,4)
// TRISD<TRISD5>
extern volatile __bit                   TRISD5              __at(0x1FE2D);	// @ (0x3FC5 * 8 + 5)
#define                                 TRISD5_bit          _BIT_ACCESS(TRISD,5)
// TRISD<TRISD6>
extern volatile __bit                   TRISD6              __at(0x1FE2E);	// @ (0x3FC5 * 8 + 6)
#define                                 TRISD6_bit          _BIT_ACCESS(TRISD,6)
// TRISD<TRISD7>
extern volatile __bit                   TRISD7              __at(0x1FE2F);	// @ (0x3FC5 * 8 + 7)
#define                                 TRISD7_bit          _BIT_ACCESS(TRISD,7)
// TRISE<TRISE0>
extern volatile __bit                   TRISE0              __at(0x1FE30);	// @ (0x3FC6 * 8 + 0)
#define                                 TRISE0_bit          _BIT_ACCESS(TRISE,0)
// TRISE<TRISE1>
extern volatile __bit                   TRISE1              __at(0x1FE31);	// @ (0x3FC6 * 8 + 1)
#define                                 TRISE1_bit          _BIT_ACCESS(TRISE,1)
// TRISE<TRISE2>
extern volatile __bit                   TRISE2              __at(0x1FE32);	// @ (0x3FC6 * 8 + 2)
#define                                 TRISE2_bit          _BIT_ACCESS(TRISE,2)
// TRISF<TRISF0>
extern volatile __bit                   TRISF0              __at(0x1FE38);	// @ (0x3FC7 * 8 + 0)
#define                                 TRISF0_bit          _BIT_ACCESS(TRISF,0)
// TRISF<TRISF1>
extern volatile __bit                   TRISF1              __at(0x1FE39);	// @ (0x3FC7 * 8 + 1)
#define                                 TRISF1_bit          _BIT_ACCESS(TRISF,1)
// TRISF<TRISF2>
extern volatile __bit                   TRISF2              __at(0x1FE3A);	// @ (0x3FC7 * 8 + 2)
#define                                 TRISF2_bit          _BIT_ACCESS(TRISF,2)
// TRISF<TRISF3>
extern volatile __bit                   TRISF3              __at(0x1FE3B);	// @ (0x3FC7 * 8 + 3)
#define                                 TRISF3_bit          _BIT_ACCESS(TRISF,3)
// TRISF<TRISF4>
extern volatile __bit                   TRISF4              __at(0x1FE3C);	// @ (0x3FC7 * 8 + 4)
#define                                 TRISF4_bit          _BIT_ACCESS(TRISF,4)
// TRISF<TRISF5>
extern volatile __bit                   TRISF5              __at(0x1FE3D);	// @ (0x3FC7 * 8 + 5)
#define                                 TRISF5_bit          _BIT_ACCESS(TRISF,5)
// TRISF<TRISF6>
extern volatile __bit                   TRISF6              __at(0x1FE3E);	// @ (0x3FC7 * 8 + 6)
#define                                 TRISF6_bit          _BIT_ACCESS(TRISF,6)
// TRISF<TRISF7>
extern volatile __bit                   TRISF7              __at(0x1FE3F);	// @ (0x3FC7 * 8 + 7)
#define                                 TRISF7_bit          _BIT_ACCESS(TRISF,7)
// SMT1STAT<TS>
extern volatile __bit                   TS                  __at(0x1F902);	// @ (0x3F20 * 8 + 2)
#define                                 TS_bit              _BIT_ACCESS(SMT1STAT,2)
// FVRCON<TSEN>
extern volatile __bit                   TSEN                __at(0x1F60D);	// @ (0x3EC1 * 8 + 5)
#define                                 TSEN_bit            _BIT_ACCESS(FVRCON,5)
// FVRCON<TSRNG>
extern volatile __bit                   TSRNG               __at(0x1F60C);	// @ (0x3EC1 * 8 + 4)
#define                                 TSRNG_bit           _BIT_ACCESS(FVRCON,4)
// OSCTUNE<TUN0>
extern volatile __bit                   TUN0                __at(0x1CEF0);	// @ (0x39DE * 8 + 0)
#define                                 TUN0_bit            _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<TUN1>
extern volatile __bit                   TUN1                __at(0x1CEF1);	// @ (0x39DE * 8 + 1)
#define                                 TUN1_bit            _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<TUN2>
extern volatile __bit                   TUN2                __at(0x1CEF2);	// @ (0x39DE * 8 + 2)
#define                                 TUN2_bit            _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<TUN3>
extern volatile __bit                   TUN3                __at(0x1CEF3);	// @ (0x39DE * 8 + 3)
#define                                 TUN3_bit            _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<TUN4>
extern volatile __bit                   TUN4                __at(0x1CEF4);	// @ (0x39DE * 8 + 4)
#define                                 TUN4_bit            _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<TUN5>
extern volatile __bit                   TUN5                __at(0x1CEF5);	// @ (0x39DE * 8 + 5)
#define                                 TUN5_bit            _BIT_ACCESS(OSCTUNE,5)
// SPI1TWIDTH<TWIDTH0>
extern volatile __bit                   TWIDTH0             __at(0x1E8C0);	// @ (0x3D18 * 8 + 0)
#define                                 TWIDTH0_bit         _BIT_ACCESS(SPI1TWIDTH,0)
// SPI1TWIDTH<TWIDTH1>
extern volatile __bit                   TWIDTH1             __at(0x1E8C1);	// @ (0x3D18 * 8 + 1)
#define                                 TWIDTH1_bit         _BIT_ACCESS(SPI1TWIDTH,1)
// SPI1TWIDTH<TWIDTH2>
extern volatile __bit                   TWIDTH2             __at(0x1E8C2);	// @ (0x3D18 * 8 + 2)
#define                                 TWIDTH2_bit         _BIT_ACCESS(SPI1TWIDTH,2)
// SPI1TXB<TXB0>
extern volatile __bit                   TXB0                __at(0x1E888);	// @ (0x3D11 * 8 + 0)
#define                                 TXB0_bit            _BIT_ACCESS(SPI1TXB,0)
// SPI1TXB<TXB1>
extern volatile __bit                   TXB1                __at(0x1E889);	// @ (0x3D11 * 8 + 1)
#define                                 TXB1_bit            _BIT_ACCESS(SPI1TXB,1)
// SPI1TXB<TXB2>
extern volatile __bit                   TXB2                __at(0x1E88A);	// @ (0x3D11 * 8 + 2)
#define                                 TXB2_bit            _BIT_ACCESS(SPI1TXB,2)
// SPI1TXB<TXB3>
extern volatile __bit                   TXB3                __at(0x1E88B);	// @ (0x3D11 * 8 + 3)
#define                                 TXB3_bit            _BIT_ACCESS(SPI1TXB,3)
// SPI1TXB<TXB4>
extern volatile __bit                   TXB4                __at(0x1E88C);	// @ (0x3D11 * 8 + 4)
#define                                 TXB4_bit            _BIT_ACCESS(SPI1TXB,4)
// SPI1TXB<TXB5>
extern volatile __bit                   TXB5                __at(0x1E88D);	// @ (0x3D11 * 8 + 5)
#define                                 TXB5_bit            _BIT_ACCESS(SPI1TXB,5)
// SPI1TXB<TXB6>
extern volatile __bit                   TXB6                __at(0x1E88E);	// @ (0x3D11 * 8 + 6)
#define                                 TXB6_bit            _BIT_ACCESS(SPI1TXB,6)
// SPI1TXB<TXB7>
extern volatile __bit                   TXB7                __at(0x1E88F);	// @ (0x3D11 * 8 + 7)
#define                                 TXB7_bit            _BIT_ACCESS(SPI1TXB,7)
// SPI1CON2<TXR>
extern volatile __bit                   TXR                 __at(0x1E8B1);	// @ (0x3D16 * 8 + 1)
#define                                 TXR_bit             _BIT_ACCESS(SPI1CON2,1)
// SPI1INTE<TXUIE>
extern volatile __bit                   TXUIE               __at(0x1E8D9);	// @ (0x3D1B * 8 + 1)
#define                                 TXUIE_bit           _BIT_ACCESS(SPI1INTE,1)
// SPI1INTF<TXUIF>
extern volatile __bit                   TXUIF               __at(0x1E8D1);	// @ (0x3D1A * 8 + 1)
#define                                 TXUIF_bit           _BIT_ACCESS(SPI1INTF,1)
// U1CON0<U1ABDEN>
extern volatile __bit                   U1ABDEN             __at(0x1EF96);	// @ (0x3DF2 * 8 + 6)
#define                                 U1ABDEN_bit         _BIT_ACCESS(U1CON0,6)
// U1UIR<U1ABDIE>
extern volatile __bit                   U1ABDIE             __at(0x1EFC2);	// @ (0x3DF8 * 8 + 2)
#define                                 U1ABDIE_bit         _BIT_ACCESS(U1UIR,2)
// U1UIR<U1ABDIF>
extern volatile __bit                   U1ABDIF             __at(0x1EFC6);	// @ (0x3DF8 * 8 + 6)
#define                                 U1ABDIF_bit         _BIT_ACCESS(U1UIR,6)
// U1ERRIE<U1ABDOVE>
extern volatile __bit                   U1ABDOVE            __at(0x1EFD5);	// @ (0x3DFA * 8 + 5)
#define                                 U1ABDOVE_bit        _BIT_ACCESS(U1ERRIE,5)
// U1ERRIR<U1ABDOVF>
extern volatile __bit                   U1ABDOVF            __at(0x1EFCD);	// @ (0x3DF9 * 8 + 5)
#define                                 U1ABDOVF_bit        _BIT_ACCESS(U1ERRIR,5)
// U1CON0<U1BRGS>
extern volatile __bit                   U1BRGS              __at(0x1EF97);	// @ (0x3DF2 * 8 + 7)
#define                                 U1BRGS_bit          _BIT_ACCESS(U1CON0,7)
// U1CON1<U1BRKOVR>
extern volatile __bit                   U1BRKOVR            __at(0x1EF99);	// @ (0x3DF3 * 8 + 1)
#define                                 U1BRKOVR_bit        _BIT_ACCESS(U1CON1,1)
// U1CON2<U1C0EN>
extern volatile __bit                   U1C0EN              __at(0x1EFA3);	// @ (0x3DF4 * 8 + 3)
#define                                 U1C0EN_bit          _BIT_ACCESS(U1CON2,3)
// U1ERRIE<U1CERIE>
extern volatile __bit                   U1CERIE             __at(0x1EFD4);	// @ (0x3DFA * 8 + 4)
#define                                 U1CERIE_bit         _BIT_ACCESS(U1ERRIE,4)
// U1ERRIR<U1CERIF>
extern volatile __bit                   U1CERIF             __at(0x1EFCC);	// @ (0x3DF9 * 8 + 4)
#define                                 U1CERIF_bit         _BIT_ACCESS(U1ERRIR,4)
// PIE3<U1EIE>
extern volatile __bit                   U1EIE               __at(0x1CC9D);	// @ (0x3993 * 8 + 5)
#define                                 U1EIE_bit           _BIT_ACCESS(PIE3,5)
// PIR3<U1EIF>
extern volatile __bit                   U1EIF               __at(0x1CD1D);	// @ (0x39A3 * 8 + 5)
#define                                 U1EIF_bit           _BIT_ACCESS(PIR3,5)
// IPR3<U1EIP>
extern volatile __bit                   U1EIP               __at(0x1CC1D);	// @ (0x3983 * 8 + 5)
#define                                 U1EIP_bit           _BIT_ACCESS(IPR3,5)
// U1ERRIE<U1FERIE>
extern volatile __bit                   U1FERIE             __at(0x1EFD3);	// @ (0x3DFA * 8 + 3)
#define                                 U1FERIE_bit         _BIT_ACCESS(U1ERRIE,3)
// U1ERRIR<U1FERIF>
extern volatile __bit                   U1FERIF             __at(0x1EFCB);	// @ (0x3DF9 * 8 + 3)
#define                                 U1FERIF_bit         _BIT_ACCESS(U1ERRIR,3)
// U1CON2<U1FLO0>
extern volatile __bit                   U1FLO0              __at(0x1EFA0);	// @ (0x3DF4 * 8 + 0)
#define                                 U1FLO0_bit          _BIT_ACCESS(U1CON2,0)
// U1CON2<U1FLO1>
extern volatile __bit                   U1FLO1              __at(0x1EFA1);	// @ (0x3DF4 * 8 + 1)
#define                                 U1FLO1_bit          _BIT_ACCESS(U1CON2,1)
// PIE3<U1IE>
extern volatile __bit                   U1IE                __at(0x1CC9E);	// @ (0x3993 * 8 + 6)
#define                                 U1IE_bit            _BIT_ACCESS(PIE3,6)
// PIR3<U1IF>
extern volatile __bit                   U1IF                __at(0x1CD1E);	// @ (0x39A3 * 8 + 6)
#define                                 U1IF_bit            _BIT_ACCESS(PIR3,6)
// IPR3<U1IP>
extern volatile __bit                   U1IP                __at(0x1CC1E);	// @ (0x3983 * 8 + 6)
#define                                 U1IP_bit            _BIT_ACCESS(IPR3,6)
// PMD5<U1MD>
extern volatile __bit                   U1MD                __at(0x1CE2C);	// @ (0x39C5 * 8 + 4)
#define                                 U1MD_bit            _BIT_ACCESS(PMD5,4)
// U1CON0<U1MODE0>
extern volatile __bit                   U1MODE0             __at(0x1EF90);	// @ (0x3DF2 * 8 + 0)
#define                                 U1MODE0_bit         _BIT_ACCESS(U1CON0,0)
// U1CON0<U1MODE1>
extern volatile __bit                   U1MODE1             __at(0x1EF91);	// @ (0x3DF2 * 8 + 1)
#define                                 U1MODE1_bit         _BIT_ACCESS(U1CON0,1)
// U1CON0<U1MODE2>
extern volatile __bit                   U1MODE2             __at(0x1EF92);	// @ (0x3DF2 * 8 + 2)
#define                                 U1MODE2_bit         _BIT_ACCESS(U1CON0,2)
// U1CON0<U1MODE3>
extern volatile __bit                   U1MODE3             __at(0x1EF93);	// @ (0x3DF2 * 8 + 3)
#define                                 U1MODE3_bit         _BIT_ACCESS(U1CON0,3)
// U1CON1<U1ON>
extern volatile __bit                   U1ON                __at(0x1EF9F);	// @ (0x3DF3 * 8 + 7)
#define                                 U1ON_bit            _BIT_ACCESS(U1CON1,7)
// U1ERRIE<U1PERIE>
extern volatile __bit                   U1PERIE             __at(0x1EFD6);	// @ (0x3DFA * 8 + 6)
#define                                 U1PERIE_bit         _BIT_ACCESS(U1ERRIE,6)
// U1ERRIR<U1PERIF>
extern volatile __bit                   U1PERIF             __at(0x1EFCE);	// @ (0x3DF9 * 8 + 6)
#define                                 U1PERIF_bit         _BIT_ACCESS(U1ERRIR,6)
// U1FIFO<U1RCIDL>
extern volatile __bit                   U1RCIDL             __at(0x1EFBB);	// @ (0x3DF7 * 8 + 3)
#define                                 U1RCIDL_bit         _BIT_ACCESS(U1FIFO,3)
// U1CON2<U1RUNOVF>
extern volatile __bit                   U1RUNOVF            __at(0x1EFA7);	// @ (0x3DF4 * 8 + 7)
#define                                 U1RUNOVF_bit        _BIT_ACCESS(U1CON2,7)
// U1FIFO<U1RXBE>
extern volatile __bit                   U1RXBE              __at(0x1EFB9);	// @ (0x3DF7 * 8 + 1)
#define                                 U1RXBE_bit          _BIT_ACCESS(U1FIFO,1)
// U1FIFO<U1RXBF>
extern volatile __bit                   U1RXBF              __at(0x1EFB8);	// @ (0x3DF7 * 8 + 0)
#define                                 U1RXBF_bit          _BIT_ACCESS(U1FIFO,0)
// U1CON1<U1RXBIMD>
extern volatile __bit                   U1RXBIMD            __at(0x1EF9B);	// @ (0x3DF3 * 8 + 3)
#define                                 U1RXBIMD_bit        _BIT_ACCESS(U1CON1,3)
// U1ERRIE<U1RXBKIE>
extern volatile __bit                   U1RXBKIE            __at(0x1EFD2);	// @ (0x3DFA * 8 + 2)
#define                                 U1RXBKIE_bit        _BIT_ACCESS(U1ERRIE,2)
// U1ERRIR<U1RXBKIF>
extern volatile __bit                   U1RXBKIF            __at(0x1EFCA);	// @ (0x3DF9 * 8 + 2)
#define                                 U1RXBKIF_bit        _BIT_ACCESS(U1ERRIR,2)
// U1CON0<U1RXEN>
extern volatile __bit                   U1RXEN              __at(0x1EF94);	// @ (0x3DF2 * 8 + 4)
#define                                 U1RXEN_bit          _BIT_ACCESS(U1CON0,4)
// U1ERRIE<U1RXFOIE>
extern volatile __bit                   U1RXFOIE            __at(0x1EFD1);	// @ (0x3DFA * 8 + 1)
#define                                 U1RXFOIE_bit        _BIT_ACCESS(U1ERRIE,1)
// U1ERRIR<U1RXFOIF>
extern volatile __bit                   U1RXFOIF            __at(0x1EFC9);	// @ (0x3DF9 * 8 + 1)
#define                                 U1RXFOIF_bit        _BIT_ACCESS(U1ERRIR,1)
// U1FIFO<U1RXIDL>
extern volatile __bit                   U1RXIDL             __at(0x1EFBB);	// @ (0x3DF7 * 8 + 3)
#define                                 U1RXIDL_bit         _BIT_ACCESS(U1FIFO,3)
// PIE3<U1RXIE>
extern volatile __bit                   U1RXIE              __at(0x1CC9B);	// @ (0x3993 * 8 + 3)
#define                                 U1RXIE_bit          _BIT_ACCESS(PIE3,3)
// PIR3<U1RXIF>
extern volatile __bit                   U1RXIF              __at(0x1CD1B);	// @ (0x39A3 * 8 + 3)
#define                                 U1RXIF_bit          _BIT_ACCESS(PIR3,3)
// IPR3<U1RXIP>
extern volatile __bit                   U1RXIP              __at(0x1CC1B);	// @ (0x3983 * 8 + 3)
#define                                 U1RXIP_bit          _BIT_ACCESS(IPR3,3)
// U1CON2<U1RXPOL>
extern volatile __bit                   U1RXPOL             __at(0x1EFA6);	// @ (0x3DF4 * 8 + 6)
#define                                 U1RXPOL_bit         _BIT_ACCESS(U1CON2,6)
// U1CON1<U1SENDB>
extern volatile __bit                   U1SENDB             __at(0x1EF98);	// @ (0x3DF3 * 8 + 0)
#define                                 U1SENDB_bit         _BIT_ACCESS(U1CON1,0)
// U1CON2<U1STP0>
extern volatile __bit                   U1STP0              __at(0x1EFA4);	// @ (0x3DF4 * 8 + 4)
#define                                 U1STP0_bit          _BIT_ACCESS(U1CON2,4)
// U1CON2<U1STP1>
extern volatile __bit                   U1STP1              __at(0x1EFA5);	// @ (0x3DF4 * 8 + 5)
#define                                 U1STP1_bit          _BIT_ACCESS(U1CON2,5)
// U1FIFO<U1STPMD>
